Repository: knehez/edx-hun-trans
Catalog: django-studio.po
Languages: hu

source: invalid JSON
hu: érvénytelen JSON

source: must have name of the configuration
hu: a konfiguráció nevét kötelező megadni

source: must have at least one group
hu: legalább egy csoportnak lennie kell

source: Invalid course update id.
hu: Érvénytelen kurzusfrissítés id.

source: Course update not found.
hu: Kurzusfrissítés nem található.

source: Could not index item: {}
hu: Az elem nem indexálható: {}

source: General indexing error occurred
hu: Általános indexelési hiba történt

source: (Unnamed)
hu: (Névtelen)

source: GIT_REPO_EXPORT_DIR not set or path {0} doesn't exist, please create it, or configure a different path with GIT_REPO_EXPORT_DIR
hu: GIT_REPO_EXPORT_DIR nincs létrehozva vagy az elérési út {0} nem létezik. Kérjük, hozza létre vagy állítsa be az elérési útvonalat az GIT_REPO_EXPORT_DIR könyvtárhoz!

source: Non writable git url provided. Expecting something like: git@github.com:mitocw/edx4edx_lite.git
hu: A megadott git url nem írható. Valami ilyesmit várunk: git@github.com:mitocw/edx4edx_lite.git

source: If using http urls, you must provide the username and password in the url. Similar to https://user:pass@github.com/user/course.
hu: Ha http url-t használ, gondoskodnia kell a felhasználónévről és a jelszóról az url-ben. Hasonlóan ehhez https://user:pass@github.com/user/course.

source: Unable to determine branch, repo in detached HEAD mode
hu: Nem sikerült azonosítani az ágat, a repo leválasztott HEAD módjában

source: Unable to update or clone git repository.
hu: Nem sikerült a git repository frissítése vagy klónozása.

source: Unable to export course to xml.
hu: Nem sikerült a kurzus XML formátumba történő exportálása.

source: Unable to configure git username and password
hu: A git felhasználói név és jelszó konfigurálása sikertelen.

source: Unable to commit changes. This is usually because there are no changes to be committed
hu: Nem sikerült a változásokat elmenteni. Ez általában azért történik, mert nem volt változás.

source: Unable to push changes. This is usually because the remote repository cannot be contacted
hu: Nem sikerült a változásokat elmenteni. Ez gyakran azért történik, mert nem sikerül kapcsolatot létesíteni a távoli repository-val.

source: Bad course location provided
hu: Hibás kurzushely került megadásra.

source: Missing branch on fresh clone
hu: Hiányzik az ág a friss klónból

source: Take the specified course and attempt to export it to a git repository . Course directory must already be a git repository. Usage: git_export <course_loc> <git_url>
hu: Megadott kurzus exportálása git repository-ba. . A kurzus könyvtárának már jelen kell lennie a git repository-ban. Használata: git_export <course_loc> <git_url>

source: File {filename} exceeds maximum size of {size_mb} MB. Please follow the instructions here to upload a file elsewhere and link to it instead: {faq_url}
hu: A {filename} mérete meghaladja a maximális {size_mb} MB méretet. Kérlek, kövesd az itt található instrukciókat arra vonatkozóan, hogyan tudnád máshová feltölteni és ide linkelni: {faq_url}

source: Upload completed
hu: Feltöltés befejezve

source: must have name of the certificate
hu: A bizonyítvány neve kötelező

source: Certificate dict {0} missing value key '{1}'
hu: A dict {0} bizonyítvány '{1}' kulcsa hiányzik

source: PermissionDenied: Failed in authenticating {user}
hu: Hozzáférés megtagadva: A felhasználó {user} nem azonosítható

source: Video
hu: Videó

source: Blank
hu: Üres

source: Course has been successfully reindexed.
hu: A kurzus sikeresen újraindexelve.

source: Unscheduled
hu: Nincs ütemezve

source: Special characters not allowed in organization, course number, and course run.
hu: Speciális karakterek nem használhatóak intézménynél, kurzus számnál és a kurzus időszakánál.

source: There is already a course defined with the same organization and course number. Please change either organization or course number to be unique.
hu: Már létezik egy kurzus ugyanazzal a szervezettel és kurzusszámmal. Kérlek, változtasd meg a szervezetet vagy a kurzus számát egyedire!

source: Please change either the organization or course number so that it is unique.
hu: Kérjük, változtassa meg a szervezetet vagy a kurzus számát, hogy a kurzus egyedi legyen.

source: Unable to create course '{name}'. {err}
hu: A '{name}' kurzus létrehozása sikertelen. {err}

source: Invalid prerequisite course key
hu: Helytelen előfeltételi kurzus kód

source: An error occurred while trying to save your tabs
hu: A fülek mentésekor hiba történt

source: Tabs Exception
hu: Fülhiba.

source: This group configuration is in use and cannot be deleted.
hu: A csoport használatban van, így nem törölhető

source: This content group is in use and cannot be deleted.
hu: A tartalomcsoport használatban van és nem törölhető.

source: Entrance Exam - Subsection
hu: Felvételi vizsga - alfejezet

source: Completed Course Entrance Exam
hu: Felvételi vizsga teljesítve

source: Course successfully exported to git repository
hu: A kurzus sikeresen exportálva lett a git repository-ba.

source: Vertical
hu: Függőleges

source: Empty
hu: Üres

source: We only support uploading a .tar.gz file.
hu: Csak .tar.gz fájlt fogadunk el.

source: File upload corrupted. Please try again
hu: A fájlfeltöltés sikertelen. Kérlek, próbáld újra!

source: Could not find the {0} file in the package.
hu: Nem találom a {0} fájlt a csomagban.

source: Invalid data
hu: Hibás adat

source: Invalid data ({details})
hu: Hibás adat ({details})

source: Duplicate of {0}
hu: {0} duplán szerepel.

source: Duplicate of '{0}'
hu: '{0}' duplán szerepel.

source: Students must score {score}{pct_sign} or higher to access course materials.
hu: Legalább {score}{pct_sign}-ot el kell érni a hallgatóknak, hogy a kurzus anyagához hozzáférjenek.

source: Unable to create library - missing required field '{field}'
hu: Könyvtár létrehozása sikertelen - kötelező mezők hiányoznak: '{field}'

source: Unable to create library '{name}'. {err}
hu: Könyvtár létrehozása sikertelen '{name}'. {err}

source: There is already a library defined with the same organization and library code. Please change your library code so that it is unique within your organization.
hu: Már van egy könyvtár ugyanezzel a szervezetnévvel és könyvtárkóddal. Változtasd meg a könyvtárkódot!

source: Incoming video data is empty.
hu: A bejövő videó nem tartalmaz adatot.

source: Can't find item by locator.
hu: Nem található elem.

source: Transcripts are supported only for "video" modules.
hu: A feliratot csak a "videó" modul támogatja.

source: Insufficient permissions
hu: Nem megfelelő jogosultság

source: Could not find user by email address '{email}'.
hu: Nem található felhasználó '{email}' e-mail címmel.

source: User {email} has registered but has not yet activated his/her account.
hu: {email} felhasználó regisztrált, de még nem erősítette meg a fiókját.

source: No `role` specified.
hu: Nincs `szerepkör` meghatározva.

source: Invalid `role` specified.
hu: Helytelen `szerepkör`

source: You may not remove the last Admin. Add another Admin first.
hu: Nem törölheted az utolsó rendszergazdát! Adj hozzá egy másik rendszergazdát először!

source: Uploading
hu: Feltöltés

source: In Progress
hu: Folyamatban

source: Ready
hu: Kész

source: Failed
hu: Sikertelen

source: Invalid Token
hu: Hibás token

source: Imported
hu: Importált

source: Unknown
hu: Ismeretlen

source: Duration
hu: Hossz

source: Date Added
hu: Hozzáadás dátuma

source: Pending
hu: Folyamatban

source: unrequested
hu: kéretlen

source: pending
hu: függőben

source: granted
hu: jogosultság hozzáadva

source: denied
hu: megtagadva

source: Studio user
hu: Stúdiófelhasználó

source: The date when state was last updated
hu: Az a dátum, amikor az utolsó státuszfrissítés történt.

source: Current course creator state
hu: A kurzus létrehozásának státusza

source: Optional notes about this user (for example, why course creation access was denied)
hu: Opcionális megjegyzések a felhasználónak (pl.: miért tagadtuk meg a kurzus készítését számára)

source: Incorrect format for field '{name}'. {detailed_message}
hu: Hibás mezőformátum '{name}'. {detailed_message}
