Repository: knehez/edx-hun-trans
Catalog: extra.po
Languages: hu

source: Please enter your %{field}s.
hu: Hiányzó mező: %{field}s.

source: The email address you\'ve provided isn\'t formatted correctly.
hu: A megadott email cím formátuma helytelen.

source: This is the first Hungarian Massive Open Online Course - Learning Management System.
hu: Csatlakozz Magyarország legnagyobb nyílt online tanulmányi rendszeréhez.

source: Welcome to MeMooc platform!
hu: Üdvözlünk a MeMooc rendszerben!

source: Courses
hu: Kurzusok

source: Online Courses
hu: Online Kurzusaink

source: Learning Center
hu: Oktatási Központ

source: Our Courses
hu: Kurzusaink

source: Users Manual
hu: Használati útmutató

source: the social learning <br />experience
hu: a közösségi tanulás <br />élménye

source: Welcome to <b>MeMOOC</b>!
hu: Üdvözlünk a <b>MeMOOC</b> portálon!

source: Learn here the basics of Information Technology<br /><b>improve your programming skills and develop cool apps</b>
hu: Nyílt kurzusainkon sajátítsd el az informatika alapjait,<br /><b>tanulj programozni, alkalmazást fejleszteni</b>

source: <b>Apply to University of Miskolc</b> prepare for your exams<br />earn credits and get <b>certficate</b>
hu: <b>Jelentkezz a Miskolci Egyetemre,</b> készülj fel a vizsgára,<br />szerezz krediteket és zsebeld be a <b>Mérnökinformatikus FOSZ diplomát!</b>

source: Next
hu: Tovább

source: Start
hu: Kezdés

source: Scheduled
hu: Előjegyzés

source: About courses
hu: A kurzusról

source: Overview
hu: Áttekintés

source: Answer:
hu: Válasz:

source: University of Miskolc
hu: Miskolci Egyetem

source: Search our courses
hu: Keress a kurzusok között
