Repository: knehez/edx-hun-trans
Catalog: extra_js.po
Languages: hu

source: Please enter your %(field)s.
hu: Hiányzó mező: %(field)s.

source: The email address you have provided is not formatted correctly.
hu: A megadott e-mail cím formátuma helytelen.

source: Male
hu: Férfi

source: Female
hu: Nő

source: Other
hu: Egyéb

source: %(field)s must have at least %(count)d characters.
hu: %(field)s mező hossza legalább %(count)d karakter legyen.

source: %(field)s can only contain up to %(count)d characters.
hu: %(field)s mező hossza legfeljebb %(count)d karakter lehet.

source: Doctorate
hu: Doktori fokozat (PhD)

source: Master's or professional degree
hu: Mester/MSc. felsőfokú végzettség

source: Bachelor's degree
hu: Főiskolai vagy BSc fokozat

source: Associate degree
hu: Felsőfokú szakképzés

source: Secondary/high school
hu: Szakközépiskola/gimnázium

source: Junior secondary/junior high/middle school
hu: Szakiskola

source: Elementary/primary school
hu: Elemi/általános iskola

source: None
hu: Nincs

source: This post is visible only to %(group_name)s.
hu: Az ütenetet a következő csoportok láthatják: %(group_name)s.

source: This post is visible to everyone.
hu: Az üzenet mindenki számára látható

source: %(post_type)s posted %(time_ago)s by %(author)s
hu: %(author)s %(time_ago)s
