Repository: knehez/edx-hun-trans
Catalog: mako-studio.po
Languages: hu

source: We're sorry. There was a problem with the server while trying to process your last request. You may want to return to the {studio_name} Dashboard or try this request again. If you are still having problems accessing things, please feel free to {link_start}contact {studio_name} support{link_end} for further help.
hu: Hiba történt az utolsó kérés kiszolgálásánál.Térj vissza a {studio_name} irányítópultra vagy próbáld újra. Ha továbbra sem tudod elérni az oldalakat, kattints {link_start}a {studio_name} terméktámogatásra{link_end} a további segítségért.

source: Back to dashboard
hu: Vissza a főoldalra

source: Library Export
hu: Könyvtár Exportálás

source: Course Export
hu: Kurzus exportálása

source: About Exporting Libraries
hu: Könyvtárak exportálásáról

source: You can export libraries and edit them outside of {studio_name}. The exported file is a .tar.gz file (that is, a .tar file compressed with GNU Zip) that contains the library structure and content. You can also re-import libraries that you've exported.
hu: Kiexportálhatod a könyvtáraidat és a {studio_name} rendszeren kívül is szerkesztheted. A kiexportált fájl kiterjesztése .tar.gz (azaz a .tar fájl GNU Zip tömörítéssel), ez tartalmazza a könyvtár struktúráját és a tartalmat. A kiexportált könyvtárakat beimportálhatod.

source: About Exporting Courses
hu: A kurzus exportálásáról

source: You can export courses and edit them outside of {studio_name}. The exported file is a .tar.gz file (that is, a .tar file compressed with GNU Zip) that contains the course structure and content. You can also re-import courses that you've exported.
hu: Kiexportálhatod a kurzusaidat és a {studio_name} rendszeren kívül is szerkesztheted. A kiexportált fájl kiterjesztése .tar.gz (azaz a .tar fájl GNU Zip tömörítéssel), ez tartalmazza a kurzus struktúráját és a tartalmat. A kiexportált kurzusokat beimportálhatod.

source: {em_start}Caution:{em_end} When you export a course, information such as MATLAB API keys, LTI passports, annotation secret token strings, and annotation storage URLs are included in the exported data. If you share your exported files, you may also be sharing sensitive or license-specific information.
hu: {em_start}Figyelem:{em_end} Kurzus exportálás esetén olyan bizalmas információk, mint kódok, kulcsok, MATLAB API kulcsok is mentésre kerülnek. A mentett kurzus mással való megosztása esetén ez biztonsági problémákat okozhat.

source: Export My Library Content
hu: Könyvtáram tartalmának exportálása

source: Export My Course Content
hu: A kurzus tartalmának exportálása

source: Export Library Content
hu: Könyvtár tartalmának exportálása

source: Export Course Content
hu: A kurzus tartalmának exportálása

source: Data {em_start}exported with{em_end} your course:
hu: A kurzus {em_start}exportált{em_end} adatai:

source: Values from Advanced Settings, including MATLAB API keys and LTI passports
hu: Speciális beállítások a MATLAB API kulcsokkal és LTI bizonyítványokkal együtt

source: Course Content (all Sections, Sub-sections, and Units)
hu: Kurzus tartalom (összes fejezet, alfejezet és lecke)

source: Course Structure
hu: Kurzus szerkezete

source: Individual Problems
hu: Egyéni feladatok

source: Course Assets
hu: Kurzushoz tartozó eszközök

source: Course Settings
hu: Kurzus beállításai

source: Data {em_start}not exported{em_end} with your course:
hu: A kurzus {em_start}nem exportált{em_end} adatai:

source: User Data
hu: Felhasználó adatai

source: Course Team Data
hu: Oktatói csapat adatai

source: Forum/discussion Data
hu: Vitafórum adatai

source: Why export a library?
hu: Miért exportáljunk egy könyvtárat?

source: You may want to edit the XML in your library directly, outside of {studio_name}. You may want to create a backup copy of your library. Or, you may want to create a copy of your library that you can later import into another library instance and customize.
hu: Az XML fájlt a {studio_name} rendszeren kívül közvetlenül szerkesztheted. Készíthetsz a könyvtáradról biztonsági másolatot. Vagy készíthetsz egy olyan másolatot a könyvtárról, amelyet később egy másik könyvtárba importálhatsz és ott módosíthatod.

source: Opening the downloaded file
hu: Letöltött fájl megnyitása

source: Use an archive program to extract the data from the .tar.gz file. Extracted data includes the library.xml file, as well as subfolders that contain library content.
hu: Használj olyan tömörítő programot, amely képes a .tar.gz fájlok kicsomagolására. A kicsomagolt fájlok között megtalálod a library.xml fájlt és a könyvtár lényegi részeit tartalmazó jegyzékeket.

source: Learn more about exporting a library
hu: Tudj meg többet a könyvtár exportálásról

source: Why export a course?
hu: Miért exportáljam a kurzust?

source: You may want to edit the XML in your course directly, outside of {studio_name}. You may want to create a backup copy of your course. Or, you may want to create a copy of your course that you can later import into another course instance and customize.
hu: Így lehetőséged nyílik a {studio_name}-n kívül is szerkeszteni a kurzus tartalmát XML fájlok formájában. Ezen felül hasznos, mert készíthetsz biztonsági másolatot, vagy esetleg a későbbiekben egy másik kurzus keretében beimportálhatod és testre szabhatod.

source: What content is exported?
hu: Milyen tartalmak kerülnek exportálásra?

source: The course content and structure (including sections, subsections, and units) are exported. Values from Advanced Settings, including MATLAB API keys and LTI passports, are also exported. Other data, including student data, grading information, discussion forum data, course settings, and course team information, is not exported.
hu: A kurzus tartalma és struktúrája (fejezetek, alfejezetek és leckék) kerül exportálásra. A speciális beállítások, magában foglalva a MATLAB API kulcsokat és LTI bizonyítványokat, szintén exportálásra kerülnek. Olyan adatok mint a hallgatói adatok, osztályozási információk, vitafórum adatok, kurzus beállítások és kurzus csoport információk nem exportálódnak.

source: Use an archive program to extract the data from the .tar.gz file. Extracted data includes the course.xml file, as well as subfolders that contain course content.
hu: Használj olyan tömörítő programot, amely képes a .tar.gz fájlok kicsomagolására. A kicsomagolt fájlok között megtalálod a course.xml fájlt és a kurzus lényegi részeit tartalmazó jegyzékeket.

source: Learn more about exporting a course
hu: Tudj meg többet a kurzus exportálásáról

source: Export Course to Git
hu: Kurzus exportálása Git-re

source: Export to Git
hu: Exportálás Git-re

source: About Export to Git
hu: Git-re exportálásról

source: Use this to export your course to its git repository.
hu: Ezt használd a kurzus git repository-ba történő exportálásához.

source: This will then trigger an automatic update of the main LMS site and update the contents of your course visible there to students if automatic git imports are configured.
hu: Ez a változtatás maga után vonja a fő LMS automatikus frissítését. Ha automatikus git importálás van beállítva akkor a kurzusod tartalma és láthatósága is frissül.

source: Export Course to Git:
hu: Kurzus exportálása Git-re

source: giturl must be defined in your course settings before you can export to git.
hu: A giturl-t meg kell adnod a kurzus beállításaihoz, mielőtt exportálnád a git-be.

source: Export Failed
hu: Exportálás sikertelen

source: Export Succeeded
hu: Exportálás sikeres

source: Your course:
hu: Kurzusod:

source: Course git url:
hu: A kurzus git url-je:

source: Content Groups
hu: Tartalom csoportok

source: Experiment Group Configurations
hu: Csoport beállításai

source: This module is disabled at the moment.
hu: Ez a modul jelenleg le van tiltva.

source: If you have cohorts enabled in your course, you can use content groups to create cohort-specific courseware. In other words, you can customize the content that particular cohorts see in your course.
hu: Ha a kurzusodban engedélyezve vannak a tanulócsoportok akkor tartalom csoportokat hozhatsz létre, hogy tanulócsoportoknak egyedi tananyagot adhass. Más szavakkal: beállíthatod, hogy az egyes tanulócsoportok milyen egyedi tartalmat lássanak a kurzusodban.

source: Each content group that you create can be associated with one or more cohorts. In addition to course content that is intended for all students, you can designate some content as visible only to specified content groups. Only learners in the cohorts that are associated with the specified content groups see the additional content.
hu: Minden tartalomcsoport, amelyet létrehozol egy vagy több tanulócsoporttal összerendelhető. Továbbá az a kurzus anyag, amelyet minden hallgatónak készítettél, beállítható úgy, hogy csak bizonyos tartalomcsoportok számára legyen látható. Így csak azok a hallgatók látják majd, akik abba a tanulócsoportba tartoznak, amelyik össze van rendelve a tartalom csoporttal.

source: Click {em_start}New content group{em_end} to add a new content group. To edit the name of a content group, hover over its box and click {em_start}Edit{em_end}. You can delete a content group only if it is not in use by a unit. To delete a content group, hover over its box and click the delete icon.
hu: Kattints az {em_start}Új tartalom csoport{em_end} menüre az új tartalom csoport hozzáadásához. A tartalom csoport nevének szerkesztéséhez vidd a kurzort a doboza felé és kattints a {em_start}Szerkeszt{em_end} menüre. Csak akkor törölheted a tartalom csoportot, ha egy lecke sem használja. A tartalom csoport törléséhez vidd a kurzort a doboza felé és kattints a törlés ikonra.

source: Learn More
hu: Tudj meg többet

source: Use experiment group configurations if you are conducting content experiments, also known as A/B testing, in your course. Experiment group configurations define how many groups of students are in a content experiment. When you create a content experiment for a course, you select the group configuration to use.
hu: A kontrollcsoport konfigurációt akkor használhatod, ha kísérletet hajtasz végre. Szokták ezt A/B tesztnek is nevezni. A kontrollcsoport beállításakor megadhatod, hány csoportra akarod bontani a kísérletezőket. Ha kontrollcsoportokat hozol létre, akkor a csoport konfigurációt választod.

source: Click {em_start}New Group Configuration{em_end} to add a new configuration. To edit a configuration, hover over its box and click {em_start}Edit{em_end}. You can delete a group configuration only if it is not in use in an experiment. To delete a configuration, hover over its box and click the delete icon.
hu: Kattints az {em_start}Új csoport beállítás{em_end} linkre. A beállítások szerkesztéséhez állítsd a kurzort felé és kattints a {em_start}Szerkesztés{em_end} menüre. Csak akkor törölheted a csoport beállításokat, ha azok nincsenek használatban. A törléshez állítsd a kurzort felé és kattints a törlés ikonra.

source: Welcome
hu: Üdvözlünk

source: Welcome to {studio_name}
hu: Üdvözlünk a {studio_name}-ban

source: {studio_name} helps manage your online courses, so you can focus on teaching them
hu: A {studio_name} segít az online kurzusod kezelésében, így a tanításra fókuszálhatsz

source: {studio_name}'s Many Features
hu: {studio_name} rendszer szolgáltatásai

source: {studio_name} Helps You Keep Your Courses Organized
hu: {studio_name} Segít a kurzusaidat megszervezni

source: Keeping Your Course Organized
hu: Legyen a kurzusod jól szervezett

source: The backbone of your course is how it is organized. {studio_name} offers an <strong>Outline</strong> editor, providing a simple hierarchy and easy drag and drop to help you and your students stay organized.
hu: A kurzusaidat rugalmasan szerkesztheted. A {studio_name} a <strong>Vázlat</strong> szerkesztővel könnyen hierarchikusan szerkeszthetővé válnak a kurzusok. A jól ismert "fogd és vidd" technika segítségével könnyen átszervezhető a kurzus felépítése.

source: Simple Organization For Content
hu: A tartalmak egyszerű szervezése

source: {studio_name} uses a simple hierarchy of <strong>sections</strong> and <strong>subsections</strong> to organize your content.
hu: A {studio_name} <strong>fejezetek</strong> és <strong>alfejezetek</strong> egyszerű hierarchiáját használja, hogy könnyen szervezhesd a tananyagaidat.

source: Change Your Mind Anytime
hu: Gondold meg magad bármikor

source: Draft your outline and build content anywhere. Simple drag and drop tools let you reorganize quickly.
hu: Elkészítetted a vázlatot, de a tartalom nem megfelelő. Egyszerű fogd és vidd technikával gyorsan szervezd újra.

source: Go A Week Or A Semester At A Time
hu: Egy hét, vagy egy szemeszter egy időben

source: Build and release <strong>sections</strong> to your students incrementally. You don't have to have it all done at once.
hu: Készíts és publikálj mindig csak egy-egy <strong>fejezetet</strong>. Nem kell elkészítened előre az egész anyagot.

source: Learning is More than Just Lectures
hu: A tanulás nem csak az előadásokból áll

source: {studio_name} lets you weave your content together in a way that reinforces learning. Insert videos, discussions, and a wide variety of exercises with just a few clicks.
hu: {studio_name} segítségével összefésülheted a tartalmakat úgy, hogy a tanulás a leghatékonyabb legyen. Szúrj be videókat, vitákat, és a feladatok széles választékát néhány kattintással.

source: Create Learning Pathways
hu: Logikusan építsd fel a tananyagot

source: Help your students understand one concept at a time with multimedia, HTML, and exercises.
hu: Segítsd a tanulókat azzal, hogy egyszerre csak egy témával foglalkozol. Készíts multimédiás anyagot, HTML oldalt, és feladatokat.

source: Work Visually, Organize Quickly
hu: Dolgozz vizuálisan, készítsd el gyorsan

source: Work visually and see exactly what your students will see. Reorganize all your content with drag and drop.
hu: Dolgozz vizuálisan: pontosan azt látod, amit a tanulók is látni fognak. Szerkeszd át az anyag sorrendjét fogd és vidd technikával.

source: A Broad Library of Problem Types
hu: Feladattípusok széles palettája

source: It's more than just multiple choice. {studio_name} supports more than a dozen types of problems to challenge your learners.
hu: Nem csak egyszerű kiválasztásos feladatok léteznek. A {studio_name} több tucat feladattípust támogat, hogy minél nagyobb kihívás elé tudd állítani a diákjaidat.

source: {studio_name} Gives You Simple, Fast, and Incremental Publishing. With Friends.
hu: {studio_name} egyszerű, gyors és inkrementális nyilvánosságra hozatal. A barátaiddal.

source: Simple, Fast, and Incremental Publishing. With Friends.
hu: Egyszerű, gyors és egyenként történő publikálás. Akár csapatban is.

source: {studio_name} works like web applications you already know, yet understands how you build curriculum. Instant publishing to the web when you want it, incremental release when it makes sense. And with co-authors, you can have a whole team building a course, together.
hu: {studio_name} úgy működik, mint egy webes program, amit már ismersz és tudod, hogyan készíts vele tananyagot. Publikálj azonnal a webre, ha azt akarod. Vagy töltsd fel az anyagodat részenként. Dolgozhatsz szerzőtársakkal, nagy csapatban jobban halad a kurzuskészítés.

source: Instant Changes
hu: Azonnali változások

source: Caught a bug? No problem. When you want, your changes go live when you click Save.
hu: Elkövettél valamilyen hibát? Nincs semmi baj. Amikor akarod, kijavíthatod, csak a mentésre kell kattintanod és a rendszerben már az új verzió lesz elérhető.

source: Release-On Date Publishing
hu: Add meg a megjelenítés napját

source: When you've finished a <strong>section</strong>, pick when you want it to go live and {studio_name} takes care of the rest. Build your course incrementally.
hu: Amikor befejeztél egy <strong>fejezetet</strong>, állítsd be, hogy mikor akarod elérhetővé tenni, a {studio_name} gondoskodik a többi teendőről. Építsd a kurzusod lépésről-lépésre.

source: Work in Teams
hu: Dolgozz csapatban

source: Co-authors have full access to all the same authoring tools. Make your course better through a team effort.
hu: A társszerzők teljes kurzusfejlesztői joggal rendelkeznek. Tedd jobbá a kurzusod a csoportmunkában rejlő lehetőségekkel.

source: Sign Up for {studio_name} Today!
hu: Regisztrálj a {studio_name}-ra még ma!

source: Sign Up &amp; Start Making an {platform_name} Course
hu: Regisztrálj és készítsd el az {platform_name} kurzusod

source: Already have a {studio_name} Account? Sign In
hu: Már van {studio_name} fiókod? Jelentkezz be

source: Outlining Your Course
hu: Kurzusod vázlata

source: Simple two-level outline to organize your couse. Drag and drop, and see your course at a glance.
hu: Egyszerű, két szintű kurzus szerkezet. Csak fogd és vidd, és egy pillanat alatt láthatod a kurzusod

source: More than Just Lectures
hu: Több, mint egy lecke

source: Quickly create videos, text snippets, inline discussions, and a variety of problem types.
hu: Készíts videókat gyorsan, adj hozzá szöveges tartalmat, vitafórumot és különböző feladatokat.

source: Publishing on Date
hu: Publikálás dátuma

source: Simply set the date of a section or subsection, and {studio_name} will publish it to your students for you.
hu: Csak állítsd be a dátumot a fejezeten vagy alfejezeten és a {studio_name} rendszer megjeleníti azokat a hallgatóidnak.

source: We're having trouble rendering your component
hu: Hiba történt a komponens feldolgozása során

source: Students will not be able to access this component. Re-edit your component to fix the error.
hu: A tanulók nem fogják tudni elérni ezt a komponenst. Szerkeszd újra, hogy kijavítsd a hibákat.

source: Library Import
hu: Könyvtár Importálás

source: Course Import
hu: Kurzus importálása

source: Be sure you want to import a library before continuing. The contents of the imported library will replace the contents of the existing library. {em_start}You cannot undo a library import{em_end}. Before you proceed, we recommend that you export the current library, so that you have a backup copy of it.
hu: Biztosan be akarod importálni a könyvtárat? A beimportált könyvtár tartalma felülírja a meglévő könyvtárat. {em_start}A könyvtár importálás nem visszavonható{em_end}. Mielőtt folytatnád, javasoljuk, hogy készíts egy biztonsági másolatot a könyvtáradról az export funkcióval.

source: The library that you import must be in a .tar.gz file (that is, a .tar file compressed with GNU Zip). This .tar.gz file must contain a library.xml file. It may also contain other files.
hu: Az importált fájl kiterjesztése .tar.gz kell legyen (azaz a .tar fájl GNU Zip tömörítéssel).Ebben lennie kell egy library.xml fájlnak és egyéb fájlokat is tartalmazhat.

source: The import process has five stages. During the first two stages, you must stay on this page. You can leave this page after the Unpacking stage has completed. We recommend, however, that you don't make important changes to your library until the import operation has completed.
hu: Az importálási folyamat öt szakaszból áll. Az első két szakasz alatt nem hagyhatod el az oldalt. Amikor a Kicsomagolás szakasz véget ért, az oldal elhagyható. Azt ajánljuk, hogy a könyvtárad tartalmában lényegi változtatásokat ne végezz, amíg az importálás be nem fejeződik.

source: Be sure you want to import a course before continuing. The contents of the imported course will replace the contents of the existing course. {em_start}You cannot undo a course import{em_end}. Before you proceed, we recommend that you export the current course, so that you have a backup copy of it.
hu: Bizonyosodj meg arról, hogy valóban akarod-e importálni a kurzust mielőtt folytatod. Az importált kurzus tartalma felülírja a meglévő kurzus tartalmát. {em_start}Az importálás nem vonható vissza{em_end}. Mielőtt folytatnád, javasoljuk exportáld ki az aktuális kurzust egy biztonsági mentés céljából.

source: The course that you import must be in a .tar.gz file (that is, a .tar file compressed with GNU Zip). This .tar.gz file must contain a course.xml file. It may also contain other files.
hu: Az importálni kívánt kurzusnak .tar.gz fájlnak kell lennie (ez azt jelenti, hogy egy .tar fájl tömörítve a GNU Zip-pel). Ennek a .tar.gz fájlnak tartalmaznia kell a course.xml fájlt. Természetesen egyéb fájlokat is tartalmaz.

source: The import process has five stages. During the first two stages, you must stay on this page. You can leave this page after the Unpacking stage has completed. We recommend, however, that you don't make important changes to your course until the import operation has completed.
hu: Az importálási eljárásnak öt szakasza van. Az első két szakaszban maradnod kell ezen az oldalon. Ezt az oldalt viszont elhagyhatod, ha befejeződött a kicsomagolásai szakasz. A biztonság kedvéért mi azt javasoljuk, hogy ne csinálj semmilyen fontos változtatást a kurzuson, amíg az importálási folyamat teljesen el nem készült.

source: Select a .tar.gz File to Replace Your Library Content
hu: Válassz egy .tar.gz fájlt, hogy felülírhasd a könyvtáradat

source: Select a .tar.gz File to Replace Your Course Content
hu: A kurzus tartalmának lecseréléséhez válassz .tar.gz fájlt

source: Choose a File to Import
hu: Válassz fájlt az importáláshoz

source: File Chosen:
hu: Kiválasztott fájl:

source: Replace my library with the selected file
hu: A könyvtár felülírása a kiválasztott fájllal

source: Replace my course with the selected file
hu: A kurzus felülírása a kiválasztott fájllal

source: Library Import Status
hu: Könyvtár importálás státusza

source: Course Import Status
hu: Kurzus importálás státusza

source: Uploading
hu: Feltöltés

source: Transferring your file to our servers
hu: A fájlok továbbítása a szerverünkre

source: Unpacking
hu: Kicsomagolás

source: Expanding and preparing folder/file structure (You can now leave this page safely, but avoid making drastic changes to content until this import is complete)
hu: A könyvtárak/fájlok struktúrájának kialakítása. (Biztonságosan elnavigálhatsz erről az oldalról, de az import befejezéséig a tartalmat ne változtasd meg túlságosan)

source: Verifying
hu: Érvényesítés

source: Reviewing semantics, syntax, and required data
hu: A szintaktika, szemantika és a kért adatok ellenőrzése

source: Updating Library
hu: Könyvtár frissítése

source: Updating Course
hu: Kurzus frissítése

source: Integrating your imported content into this library. This process might take longer with larger libraries.
hu: A beimportált tartalmat integráljuk a könyvtárba. Nagy könyvtárak esetén ez sokáig tarthat.

source: Integrating your imported content into this course. This process might take longer with larger courses.
hu: A beimportált tartalmat integráljuk a kurzusba. Nagy kurzusok esetén ez sokáig tarthat.

source: Success
hu: Siker

source: Your imported content has now been integrated into this library
hu: A beimportált tartalmat sikeresen integráltuk ebbe a könyvtárba

source: Your imported content has now been integrated into this course
hu: A tartalom importálva lett a kurzusba

source: View Updated Library
hu: Frissített könyvtár megtekintése

source: View Updated Outline
hu: Frissített vázlat megtekintése

source: Why import a library?
hu: Miért importáljunk egy könyvtárat?

source: You might want to update an existing library to a new version, or replace an existing library entirely. You might also have developed a library outside of {studio_name}.
hu: Frissítheted a meglévő könyvtáradat az új verzióra vagy a teljes meglévő könyvtárat lecserélheted. Olyan könyvtárat is használhatsz, amelyet a {studio_name} rendszeren kívül fejlesztettél.

source: Note: Library content is not automatically updated in courses
hu: Figyelem: a könyvtár tartalma nem frissül automatikusan a kurzussal
