Repository: knehez/edx-hun-trans
Catalog: mako-studio.po
Languages: hu

source: The page that you were looking for was not found.
hu: A keresett oldal nem létezik.

source: Go back to the {homepage} or let us know about any pages that may have been moved at {email}.
hu: Menj vissza a {homepage} oldalra, vagy jelezd felénk {email} címben melyik oldal került eltávolításra.

source: {studio_name} Server Error
hu: {studio_name} belső szerver hiba

source: The {studio_name} servers encountered an error
hu: {studio_name} szerver hibát jelzett

source: An error occurred in {studio_name} and the page could not be loaded. Please try again in a few moments.
hu: {studio_name} egy hiba miatt nem tudja betölteni az oldalt. Kérlek próbálkozz egy kicsit később.

source: We've logged the error and our staff is currently working to resolve this error as soon as possible.
hu: A hibát feljegyeztük, melynek javítását szakembereink elkezdik olyan gyorsan, amilyen gyorsan csak lehetséges.

source: If the problem persists, please email us at {email_link}.
hu: Ha a probléma továbbra is fennáll, kérlek küldj e-mailt az alábbi címre {email_link}.

source: {studio_name} Account Activation
hu: {studio_name} felhasználó aktiválása

source: Your account is already active
hu: A fiókod már aktiválva van

source: This account, set up using {email}, has already been activated. Please sign in to start working within {studio_name}.
hu: Ehhez az email-hez: {email} tartozó fiókot már aktiválták. Lépj be és kezd el a munkát a {studio_name}-ban.

source: Sign into {studio_name}
hu: Jelentkezz be az {studio_name}

source: Your account activation is complete!
hu: Az azonosítód aktiválásra került!

source: Thank you for activating your account. You may now sign in and start using {studio_name} to author courses.
hu: Köszönjük, hogy aktiváltál. Most már bejelentkezhetsz a {studio_name}-ba kurzusok létrehozásához.

source: Your account activation is invalid
hu: Az aktiváció érvénytelen

source: We're sorry. Something went wrong with your activation. Check to make sure the URL you went to was correct, as e-mail programs will sometimes split it into two lines.
hu: Sajnáljuk, de valami hiba történt az aktiválás során. Ellenőrizd, hogy az URL ami az e-mailben szerepel helyes-e. Van olyan e-mail program, amely széttöri két sorra a linket.

source: If you still have issues, contact {platform_name} Support. In the meantime, you can also return to {link_start}the {studio_name} homepage.{link_end}
hu: Ha van még kérdésed, akkor vedd fel a kapcsolatot az {platform_name} támogatási csoporttal. Addig is visszatérhetsz a {link_start} helyre a {studio_name}ban {link_end}

source: Contact {platform_name} Support
hu: Vedd fel a kapcsolatot a {platform_name} támogató csoporttal.

source: Files &amp; Uploads
hu: Fájlok &amp; Feltöltések

source: Content
hu: Tartalom

source: Page Actions
hu: Oldalműveletek

source: Upload New File
hu: Új fájl feltöltése

source: Adding Files for Your Course
hu: Fájlok hozzáadása a kurzushoz

source: To add files to use in your course, click {em_start}Upload New File{em_end}. Then follow the prompts to upload a file from your computer.
hu: Fájlok kurzushoz adásához kattints az {em_start}Új fájl feltöltése{em_end} gombra, majd kövesd a megjelenő utasításokat.

source: {em_start}Caution{em_end}: {platform_name} recommends that you limit the file size to {em_start}10 MB{em_end}. In addition, do not upload video or audio files. You should use a third party service to host multimedia files.
hu: {em_start}Figyelem:{em_end}: {platform_name} az edX azt javasolja, hogy a fájl mérete {em_start}10 MB-nál{em_end}. ne legyen nagyobb. Ne tölts fel videó, vagy hang fájlokat. Külső tárhelyet kell használni a multimédiás anyagok tárolására.

source: The course image, textbook chapters, and files that appear on your Course Handouts sidebar also appear in this list.
hu: A kurzus képe, a tankönyv fejezetei és azok a fájlok, melyek a kurzus vázlat oldalsó panelén láthatóak szintén megjelennek ebben a listában.

source: Using File URLs
hu: Fájl URL használata

source: Use the {em_start}{studio_name} URL{em_end} value to link to the file or image from a component, a course update, or a course handout.
hu: Használd a {em_start}{studio_name} URL{em_end}-t a fájlok vagy képek egy komponenshez való linkeléséhez.

source: Use the {em_start}Web URL{em_end} value to reference the file or image only from outside of your course. {em_start}Note:{em_end} If you lock a file, the Web URL no longer works for external access to a file.
hu: Használd a {em_start}Web URL{em_end}-t a fájlok, képek kurzuson kívüli linkeléséhez.{em_start}Figyelem:{em_end} amennyiben zárolsz egy fájlt, a Web URL nem fog tovább működni, a tartalom nem lesz elérhető kívülről.

source: To copy a URL, double click the value in the URL column, then copy the selected text.
hu: URL másolásához, kattints kettőt az értéken az URL oszlopon, ez után másolható a kiválasztott szöveg.

source: Learn more about managing files
hu: Tudj meg többet a fájlok kezeléséről

source: Max per-file size: {max_filesize}MB
hu: Feltölthető maximális fájlméret {max_filesize}MB.

source: Choose File
hu: Fájl kiválasztása

source: Your file has been deleted.
hu: A fájl törlésre került.

source: close alert
hu: figyelmeztetés bezárása

source: Course Certificates
hu: Kurzus bizonyítvány

source: Certificates
hu: Bizonyítványok

source: This module is not enabled.
hu: Ez a modul jelenleg le van tiltva.

source: Upon successful completion of your course, learners receive a certificate to acknowledge their accomplishment. If you are a course team member with the Admin role in Studio, you can configure your course certificate.
hu: A kurzus sikeres elvégzésekor a hallgatók bizonyítványt kaphatnak. Ha a kurzushoz rendszergazda jogaid vannak a Stúdióban, akkor kurzus bizonyítvány kiadását konfigurálhatod

source: Click {em_start}Add your first certificate{em_end} to add a certificate configuration. Upload the organization logo to be used on the certificate, and specify at least one signatory. You can include up to four signatories for a certificate. You can also upload a signature image file for each signatory. {em_start}Note:{em_end} Signature images are used only for verified certificates. Optionally, specify a different course title to use on your course certificate. You might want to use a different title if, for example, the official course name is too long to display well on a certificate.
hu: Kattints az {em_start}Az első bizonyítvány hozzáadása{em_end} menüre a bizonyítvány konfigurálásához. Töltsd fel az egyetem logóját, amely a bizonyítványon megjelenik, és adj meg legalább egy aláírást. Egy bizonyítványhoz legfeljebb négy aláírás tartozhat. Feltölthetsz aláírás kép fájlt is. {em_start}Megjegyzés:{em_end} Aláírás képek csak az ellenőrzött bizonyítványokhoz tartoznak. Választhatsz eltérő kurzus nevet is a bizonyítványon, például akkor, ha a a hivatalos kurzusnév túl hosszú.

source: Select a course mode and click {em_start}Preview Certificate{em_end} to preview the certificate that a learner in the selected enrollment track would receive. When the certificate is ready for issuing, click {em_start}Activate.{em_end} To stop issuing an active certificate, click {em_start}Deactivate{em_end}.
hu: Válaszd ki a kurzust és kattintsa a{em_start}Bizonyítvány előnézet{em_end} linkre, hogy megtekintsd azt a bizonyítványt, amit a kurzus elvégzésekor kapnál. Ha a bizonyítványod elkészült, kattints az {em_start}Aktiválás{em_end} menüre. A megszakításhoz kattints a {em_start}Deaktiválás{em_end} menüre.

source: To edit the certificate configuration, hover over the top right corner of the form and click {em_start}Edit{em_end}. To delete a certificate, hover over the top right corner of the form and click the delete icon. In general, do not delete certificates after a course has started, because some certificates might already have been issued to learners.
hu: A bizonyítvány konfiguráció szerkesztéséhez vidd a kurzort a form jobb felső sarka fölé és kattints a {em_start}Szerkeszt{em_end} menüre. A bizonyítvány törléséhez vidd a kurzort a form jobb felső sarka fölé és kattints a törlés ikonra. Általában nem törlünk bizonyítványt a kurzus megkezdése után, mert néhány hallgató már megszerezhette azt.

source: Learn more about certificates
hu: Tudj meg többet a bizonyítványokról.

source: Other Course Settings
hu: Kurzus további beállításai

source: Details &amp; Schedule
hu: Részletek &amp; Ütemezés

source: Grading
hu: Értékelés

source: Course Team
hu: Oktatói csapat

source: Advanced Settings
hu: Speciális beállítások

source: Group Configurations
hu: Csoport beállításai

source: Course Checklists
hu: Kurzus ellenőrzőlista

source: Tools
hu: Eszközök

source: Current Checklists
hu: Aktuális ellenőrzőlista

source: What are course checklists?
hu: Mi az a kurzus ellenőrzőlista?

source: Course checklists are tools to help you understand and keep track of all the steps necessary to get your course ready for students.
hu: A kurzus ellenőrzőlistája egy olyan eszköz, ami végigvezet az összes szükséges lépésen, hogy a kurzusod sikeresen elkészüljön.

source: Any changes you make to these checklists are saved automatically and are immediately visible to other course team members.
hu: Minden változtatás amit elvégzel ezzel az ellenőrzőlistával, az azonnal láthatóvá válik a csapat többi tagja számára.

source: {studio_name} checklists
hu: {studio_name} ellenőrzőlista

source: Duplicate
hu: Duplikálás

source: Duplicate this component
hu: Komponens duplikálása

source: Delete this component
hu: Töröld ezt a komponenst

source: Drag to reorder
hu: Húzd az új sorrend kialakításához

source: Display Name
hu: Megjelenő név

source: Open the courseware in the LMS
hu: Nyisd meg a kurzust az LMS-ben.

source: View Live Version
hu: Élő nézet

source: Preview the courseware in the LMS
hu: Nézd meg a kurzus előnézetet az LMS-ben

source: Preview
hu: Előnézet

source: Adding components
hu: Komponens hozzáadása

source: Select a component type under {em_start}Add New Component{em_end}. Then select a template.
hu: Válassz lentebb komponens típust {em_start}Új komponens hozzáadása{em_end}. Majd válassz sablont.

source: The new component is added at the bottom of the page or group. You can then edit and move the component.
hu: A komponens a lap, vagy a csoport aljához került hozzáadásra. Most már szerkesztheted és akár át is mozgathatod.

source: Editing components
hu: Komponensek szerkesztése

source: Click the {em_start}Edit{em_end} icon in a component to edit its content.
hu: Kattints a {em_start}Szerkesztés{em_end} ikonra, hogy át tudd írni a komponens tartalmát.

source: Reorganizing components
hu: Komponensek újraszervezése

source: Drag components to new locations within this component.
hu: Fogd és vidd a komponenst az új helyére ezen a komponensen belül.

source: For content experiments, you can drag components to other groups.
hu: A tartalom szerkesztéséhez fogd a komponenst és vidd másik csoportba.

source: Working with content experiments
hu: Munka a tartalom csoportokkal

source: Confirm that you have properly configured content in each of your experiment groups.
hu: Ellenőrizd, hogy minden csoporthoz megfelelő tartalmat állítottál be.

source: Learn more about component containers
hu: Tudj meg többet a komponens tárolókról.

source: Unit Location
hu: Elem helye

source: Location ID
hu: Hely azonosítója

source: Use this ID when you create links to this unit from other course content. You enter the ID in the URL field.
hu: Használd ezt az azonosítót, ha linket szeretnél ehhez a leckéhez a kurzus másik tartalmában elhelyezni. Írd be az azonosítót az URL mezőbe.

source: Location in Course Outline
hu: Helye a kurzus vázlatában

source: Create a Course Rerun of:
hu: Kurzus újraindítása:

source: Create a re-run of a course
hu: Kurzus újraindítása

source: You are creating a re-run from:
hu: Kurzus újraindítása:

source: Provide identifying information for this re-run of the course. The original course is not affected in any way by a re-run.
hu: A kurzus újbóli meghirdetéséhez adj meg azonosítókat. Az eredetileg meghirdetett kurzus semmilyen formában nem lesz érintve az újbóli meghirdetésnél.

source: Note: Together, the organization, course number, and course run must uniquely identify this new course instance.
hu: Megjegyzés: a szervezet, a kurzus kódja és a kurzus időtartama egyedileg azonosítja ezt a kurzus példányt.

source: Required Information to Create a re-run of a course
hu: Kurzus újraindításához szükséges információk

source: e.g. Introduction to Computer Science
hu: pl. Bevezetés a számítástechnikába

source: The public display name for the new course. (This name is often the same as the original course name.)
hu: Az új kurzus neve, ahogy megfog jelenni. (Ez a név gyakran megegyezik az eredeti kurzus névvel.)

source: Organization
hu: Szervezet

source: e.g. UniversityX or OrganizationX
hu: pl. UniversityX vagy OrganizationX

source: The name of the organization sponsoring the new course. (This name is often the same as the original organization name.)
hu: Az új kurzust támogató szervezet neve. (Ez gyakran megegyezik a szervezet nevével.)

source: Note: No spaces or special characters are allowed.
hu: Figyelem: Szóköz és speciális karakterek használata nem megengedett.

source: e.g. CS101
hu: pl. CS101

source: The unique number that identifies the new course within the organization. (This number is often the same as the original course number.)
hu: Az egyedi szám, amely azonosítja az új kurzust a szervezeten belül. (Ez a szám gyakran megegyezik az eredeti kurzus számával.)

source: Course Run
hu: Kurzus időszaka

source: e.g. 2014_T1
hu: pl.: 2014_T1

source: The term in which the new course will run. (This value is often different than the original course run value.)
hu: Az időszak, amely alatt az új kurzus fut. (Legtöbbször ez az érték különbözik az eredeti kurzus időszakától)

source: Create Re-run
hu: Újrafuttatás készítése

source: When will my course re-run start?
hu: Mikor fog a kurzus újraindulni?

source: The new course is set to start on January 1, 2030 at midnight (UTC).
hu: Az új kurzus 2030. Január 1-jén éjfélkor (UTC szerint) fog elkezdődni.

source: What transfers from the original course?
hu: Mi kerül áttöltésre az eredeti kurzusból?

source: The new course has the same course outline and content as the original course. All problems, videos, announcements, and other files are duplicated to the new course.
hu: Az új kurzusnak ugyanaz a szerkezete és a tartalma, mint az eredetinek. Minden feladat, videó, hirdetmény és egyéb fájl az új kurzushoz másolódik.

source: What does not transfer from the original course?
hu: Mi nem kerül áttöltésre az eredeti kurzusból?

source: You are the only member of the new course's staff. No students are enrolled in the course, and there is no student data. There is no content in the discussion topics or wiki.
hu: Te vagy az egyetlen kurzus stábtag. Egy hallgató sem jelentkezett a kurzusra, így nincs hallgatói adat. Nincsenek fórum témák, se wiki.

source: Learn more about Course Re-runs
hu: Tudj meg többet a kurzus újraindításáról

source: Course Updates
hu: Kurzus hirdetményei

source: New Update
hu: Új hirdetmény

source: Use course updates to notify students of important dates or exams, highlight particular discussions in the forums, announce schedule changes, and respond to student questions. You add or edit updates in HTML.
hu: Használd a hirdetményeket arra, hogy értesítsd a tanulókat a fontos dátumokról, vagy vizsgákról, megjelöld a fontos vitákat a fórumban, értesítsd az ütemezés változásairól és válaszolj a tanulók kérdéseire. Adj hozzá, vagy szerkessz HTML formátumban.

source: Course Outline
hu: Kurzus vázlat

source: This course was created as a re-run. Some manual configuration is needed.
hu: A kurzus újraindításra előkészítve. Néhány beállítást még el kell végezni.

source: No course content is currently visible, and no students are enrolled. Be sure to review and reset all dates, including the Course Start Date; set up the course team; review course updates and other assets for dated material; and seed the discussions and wiki.
hu: A kurzus tartalma még nem látható és a tanulók sem tudnak feliratkozni rá. Győződj meg róla, hogy minden dátumot beállítottál, beleértve a Kezdő dátumot; a kurzus oktatóit; a kurzus hirdetményeit és egyéb dátum beállításokat; a vita fórumot és a wiki-t.

source: Dismiss
hu: Elvetés

source: Warning
hu: Figyelmeztetés

source: This course uses features that are no longer supported.
hu: Ezek a kurzus eszközök már nem támogatottak

source: You must delete or replace the following components.
hu: A következő komponenseket írd felül vagy töröld

source: Unsupported Components
hu: Nem támogatott komponensek

source: To avoid errors, {platform_name} strongly recommends that you remove unsupported features from the course advanced settings. To do this, go to the {link_start}Advanced Settings page{link_end}, locate the "Advanced Module List" setting, and then delete the following modules from the list.
hu: A hibák elkerülésének érdekében a {platform_name} rendszer azt ajánlja, hogy távolíts el minden nem támogatott eszközt a kurzus speciális beállításai közül. Ehhez menj a {link_start}Speciális beállítások oldalra{link_end}, válaszd a "Speciális Modulok Listája" beállítást, és a következő modulokat töröld ki.

source: Unsupported Advance Modules
hu: Nem támogatott modulok

source: Click to add a new section
hu: Kattints új fejezet létrehozásához

source: New Section
hu: Új fejezet

source: Reindex current course
hu: Aktuális kurzus újraindexelése

source: Reindex
hu: Újraindexel

source: Collapse All Sections
hu: Összes fejezet összecsukása

source: Expand All Sections
hu: Összes fejezet kinyitása

source: Click to open the courseware in the LMS in a new tab
hu: Kattints, hogy megnyissuk a tananyagot az LMS-ben új lapfülön.

source: View Live
hu: Élő nézet

source: Course Start Date:
hu: Kurzus kezdési dátuma:

source: Edit Start Date
hu: Kezdő dátum szerkesztése

source: Creating your course organization
hu: Alakítsd ki a kurzus struktúráját

source: You add sections, subsections, and units directly in the outline.
hu: Adj hozzá fejezeteket, alfejezeteket és leckéket közvetlen a vázlathoz.

source: Create a section, then add subsections and units. Open a unit to add course components.
hu: Készíts fejezetet, aztán adj hozzá alfejezetet és leckét. Nyisd meg a leckét és adj hozzá további komponenseket.

source: Reorganizing your course
hu: Szervezd át a kurzust

source: Drag sections, subsections, and units to new locations in the outline.
hu: A vázlatban húzd át a fejezeteket, alfejezeteket és leckéket az új helyükre.

source: Setting release dates and grading policies
hu: Állítsd be a megjelenés dátumát és az értékelési irányelveket

source: Select the Configure icon for a section or subsection to set its release date. When you configure a subsection, you can also set the grading policy and due date.
hu: Válaszd a beállítások ikont a fejezetek, vagy alfejezetek mellett és állítsd be a megjelenés dátumát. Amikor egy alfejezet beállításait végzed. be tudod állítani még az értékelési irányelveket és az esedékesség dátumát is.

source: Changing the content students see
hu: Változtasd meg a hallgatók által látható tartalmat

source: To publish draft content, select the Publish icon for a section, subsection, or unit.
hu: A tervezett tartalom publikálásához válaszd a Publikálás ikont a fejezet, alfejezet, vagy lecke mellett.

source: To hide content from students, select the Configure icon for a section, subsection, or unit, then select {em_start}Hide from students{em_end}.
hu: Ha el akarod rejteni a tartalmat a tanulók elöl, akkor válaszd a Beállítás ikont a fejezet, alfejezet, vagy lecke mellett és pipáld ki az {em_start}Elrejtés a tanulók elöl{em_end} jelölőnégyzetet.

source: Learn more about the course outline
hu: Tudj meg többet a kurzus vázlatról

source: Pages
hu: Lapok

source: New Page
hu: Új oldal

source: Note: Pages are publicly visible. If users know the URL of a page, they can view the page even if they are not registered for or logged in to your course.
hu: Figyelem: A lapok publikusan láthatóak. Ha a felhasználó tudja a lapok URL címét, akkor meg tudja nézni anélkül, hogy bejelentkezne, vagy regisztrálna a kurzusra.

source: Show this page
hu: Oldal megjelenítése

source: Show/hide page
hu: Oldal mutatása/elrejtése

source: This page cannot be reordered
hu: Ennek az oldalnak nem lehet megváltoztatni a sorrendjét

source: You can add additional custom pages to your course.
hu: További egyéni lapot adhatsz a kurzushoz.

source: Add a New Page
hu: Új oldal hozzáadása

source: What are pages?
hu: Mik azok a Lapok?

source: Pages are listed horizontally at the top of your course. Default pages (Courseware, Course info, Discussion, Wiki, and Progress) are followed by textbooks and custom pages that you create.
hu: Az oldalak a kurzus tetején vízszintesen vannak listázva, Az alapértelmezett oldalakat (Tananyag, Hírek, Vita, Wiki és Eredmények) a tankönyvek lap, majd egyéni lapok követik.

source: Custom pages
hu: Egyéni lapok

source: You can create and edit custom pages to provide students with additional course content. For example, you can create pages for the grading policy, course slides, and a course calendar.
hu: Készíthetsz egyéni lapokat a kurzushoz, hogy a tanulók további tartalmakat érhessenek el. Például, készíthetsz lapokat az értékelési/osztályzási szabályoknak, bemutató diáknak és a kurzus időbeosztását tartalmazó naptárnak.

source: How do pages look to students in my course?
hu: Milyennek látják a tanulók a kurzus lapjait?

source: Students see the default and custom pages at the top of your course and use these links to navigate.
hu: A tanulók az oldal tetején látják az alapértelmezett és az egyéni lapokat és ezeket a linkeket használják navigálásra.

source: See an example
hu: Lássunk egy példát

source: Pages in Your Course
hu: A kurzus Lapjai

source: Preview of Pages in your course
hu: A kurzus Lapjainak előnézete

source: Pages appear in your course's top navigation bar. The default pages (Courseware, Course Info, Discussion, Wiki, and Progress) are followed by textbooks and custom pages.
hu: A Lapok a felső navigációs területen jelennek meg. Az alapértelmezett lapokat (Tananyag, Hírek, Vita, Wiki és Eredmények) a tankönyvek lap, majd egyéni lapok követik.

source: close modal
hu: bezárás

source: Internal Server Error
hu: Belső szerver hiba

source: Use our feedback tool, Tender, to share your feedback
hu: Használd a Tender nevű eszközt, hogy megoszd velünk az észrevételeidet.

source: The Page You Requested Page Cannot be Found
hu: A keresett oldal nem található

source: We're sorry. We couldn't find the {studio_name} page you're looking for. You may want to return to the {studio_name} Dashboard and try again. If you are still having problems accessing things, please feel free to {link_start}contact {studio_name} support{link_end} for further help.
hu: A {studio_name} oldal, amit keresel, nem található. Térj vissza a {studio_name} irányítópultra és próbáld újra. Ha továbbra sem tudod elérni az oldalakat, kattints {link_start}a {studio_name} terméktámogatásra{link_end} a további segítségért.

source: The Server Encountered an Error
hu: A szerver hibát jelzett
