Repository: knehez/edx-hun-trans
Catalog: mako-studio.po
Languages: hu

source: If you change and import a library that is referenced by randomized content blocks in one or more courses, those courses do not automatically use the updated content. You must manually refresh the randomized content blocks to bring them up to date with the latest library content.
hu: Ha megváltoztatsz, majd beimportálsz egy könyvtárat, amelyet egy Véletlen tartalom blokk használ, akkor az érintett kurzusok nem frissülnek automatikusan. Neked kell kézzel frissítened a Véletlen tartalom blokkokat a legfrissebb könyvtárnak megfelelően.

source: Learn more about importing a library
hu: Tudj meg többet a könyvtár importálásról

source: Why import a course?
hu: Miért importáljak kurzust?

source: You may want to run a new version of an existing course, or replace an existing course altogether. Or, you may have developed a course outside {studio_name}.
hu: Elindíthatod egy meglévő kurzus új verzióját, vagy akár ki is cserélheted a régi kurzust. Esetleg rendelkezésedre áll egy {studio_name}-on kívül készített kurzus.

source: What content is imported?
hu: Milyen tartalom került importálásra?

source: Only the course content and structure (including sections, subsections, and units) are imported. Other data, including student data, grading information, discussion forum data, course settings, and course team information, remains the same as it was in the existing course.
hu: Csak a kurzus felépítése és tartalma (beleértve a fejezeteket, alfejezeteket és leckéket) került importálásra. Egyéb adatok, beleértve a tanulói adatokat, értékelési információkat, vitákat, kurzus beállításokat és az oktatói csapat adatait nem, azok maradtak az eredetinek megfelelőek, ha ez egy létező kurzus volt.

source: Warning: Importing while a course is running
hu: Figyelem: Importálni akarsz, miközben a kurzus folyamatban van

source: If you perform an import while your course is running, and you change the URL names (or url_name nodes) of any Problem components, the student data associated with those Problem components may be lost. This data includes students' problem scores.
hu: Amennyiben a kurzusod fut és e közben szeretnél importálni, megváltoztatni valamely komponens az URL neveit, úgy a komponenshez kapcsolódó hallgatói adatok elveszhetnek. Ezek az adatok magába foglalják a hallgatói eredménylistát is.

source: Learn more about importing a course
hu: Tudj meg többet a kurzus importálásról

source: {studio_name} Home
hu: {studio_name} Kezdőlap

source: New Course
hu: Új kurzus létrehozása

source: Email staff to create course
hu: Küldj e-mailt a stábnak, hogy kurzust készíthess

source: New Library
hu: Új könyvtár

source: Please correct the highlighted fields below.
hu: Kérlek javítsd ki a kiemelt mezőket.

source: Create a New Course
hu: Új kurzus létrehozása

source: Required Information to Create a New Course
hu: Új kurzus létrehozásához szükséges információk

source: The public display name for your course. This cannot be changed, but you can set a different display name in Advanced Settings later.
hu: A kurzusban nyilvánosan megjelenő név. Nem lehet megváltoztatni, de később a Speciális beállításoknál írhatsz be eltérő megjelenítési nevet.

source: The name of the organization sponsoring the course.
hu: A kurzust támogató szervezet neve.

source: Note: This is part of your course URL, so no spaces or special characters are allowed.
hu: Figyelem: Ez része lesz a kurzus URL címének, ezért sem szóközt, sem speciális karaktert nem tartalmazhat.

source: This cannot be changed, but you can set a different display name in Advanced Settings later.
hu: Nem lehet megváltoztatni, de később a Speciális beállításoknál írhatsz be eltérő megjelenítési nevet.

source: The unique number that identifies your course within your organization.
hu: Egyedi azonosító, ami azonosítja kurzust a szervezeten belül.

source: Note: This is part of your course URL, so no spaces or special characters are allowed and it cannot be changed.
hu: Figyelem: Ez része lesz a kurzus URL címének, ezért sem szóközt, sem speciális karaktert nem tartalmazhat.

source: The term in which your course will run.
hu: Az az időszak, amikor a kurzus megtartásra kerül. Célszerű az eredeti jelölést használni T= Term, azaz időszak.

source: Create
hu: Létrehozás

source: Create a New Library
hu: Új könyvtár létrehozása

source: Required Information to Create a New Library
hu: Új könyvtár létrehozásához szükséges adatok

source: Library Name
hu: Könyvtár neve

source: e.g. Computer Science Problems
hu: pl. Bevezetés a számítástechnikába

source: The public display name for your library.
hu: A könyvtár neve, ahogy megfog jelenni.

source: The public organization name for your library.
hu: A szervezet neve, amelyhez a könyvtár tartozni fog.

source: This cannot be changed.
hu: Ez a későbbiekben nem változtatható.

source: Library Code
hu: Könyvtár kódja

source: e.g. CSPROB
hu: pl.: AIFEL

source: The unique code that identifies this library.
hu: A könyvtárat azonosító egyedi kód.

source: Note: This is part of your library URL, so no spaces or special characters are allowed.
hu: Figyelem: a kód része a könyvtár URL-nek, ezért space és speciális karakterek nem megengedettek.

source: Courses Being Processed
hu: A kurzus feldolgozása elkészült

source: Course Run:
hu: Kurzus időszaka:

source: This course run is currently being created.
hu: A kurzus indításához szükséges dolgok elkészültek.

source: Configuring as re-run
hu: Beállítás újraindításhoz

source: The new course will be added to your course list in 5-10 minutes. Return to this page or {link_start}refresh it{link_end} to update the course list. The new course will need some manual configuration.
hu: Az új kurzus 5-10 percen belül megjelenik a kurzusok listájában. Visszatérhetsz erre az oldalra később, vagy {link_start}frissítheted{link_end} az oldalt. Az új kurzus némi kézi beállítást igényel.

source: A system error occurred while your course was being processed. Please go to the original course to try the re-run again, or contact your PM for assistance.
hu: Rendszerhiba történt a kurzus feldolgozása közben. Menj vissza az eredeti kurzushoz, hogy megpróbáld újraindítani, vagy vedd fel a kapcsolatot a PM-mel segítségért.

source: Libraries
hu: Könyvtárak

source: Re-run Course
hu: Kurzus újbóli elindítása

source: Are you staff on an existing {studio_name} course?
hu: Benne vagy a kurzus oktatói csapatában? {studio_name}

source: The course creator must give you access to the course. Contact the course creator or administrator for the course you are helping to author.
hu: A kurzus készítőjének jogosultságot kell adni ahhoz, hogy hozzáférj a kurzushoz. Vedd fel a kapcsolatot a készítővel vagy az adminisztrátorral.

source: Create Your First Course
hu: Készítsd el az első kurzusod

source: Your new course is just a click away!
hu: Az új kurzusod csak egy kattintásnyira van!

source: Becoming a Course Creator in {studio_name}
hu: A {studio_name} rendszerben kurzus létrehozási jogot kaptál

source: {studio_name} is a hosted solution for our xConsortium partners and selected guests. Courses for which you are a team member appear above for you to edit, while course creator privileges are granted by {platform_name}. Our team will evaluate your request and provide you feedback within 24 hours during the work week.
hu: A {studio_name} az xConsortium partnerek által van hosztolva. Azok a kurzusok, amelyeknek a csapatában benne vagy felül megjelennek szerkesztésre. A kurzus létrehozását a {platform_name} engedélyezi. A kérésed megvizsgáljuk és 24 órán belül válaszolunk.

source: Your Course Creator Request Status:
hu: Kurzus készítői kérésed állapota:

source: Request the Ability to Create Courses
hu: Kurzus készítései lehetőség kérése

source: Your Course Creator Request Status
hu: Kurzus készítői kérésed állapota

source: {studio_name} is a hosted solution for our xConsortium partners and selected guests. Courses for which you are a team member appear above for you to edit, while course creator privileges are granted by {platform_name}. Our team is has completed evaluating your request.
hu: A {studio_name} az xConsortium partnerek által van hosztolva. Azok a kurzusok, amelyeknek a csapatában benne vagy felül megjelennek szerkesztésre. A kurzus létrehozását a {platform_name} engedélyezi. A kérésed megvizsgáltuk.

source: Your Course Creator request is:
hu: Kurzus készítői kérésed:

source: Denied
hu: Megtagadva

source: Your request did not meet the criteria/guidelines specified by {platform_name} Staff.
hu: Sajnos a kérésed nem felelt meg a {platform_name} rendszer kritériumainak.

source: {studio_name} is a hosted solution for our xConsortium partners and selected guests. Courses for which you are a team member appear above for you to edit, while course creator privileges are granted by {platform_name}. Our team is currently evaluating your request.
hu: A {studio_name} az xConsortium partnerek által van hosztolva. Azok a kurzusok, amelyeknek a csapatában benne vagy felül megjelennek szerkesztésre. A kurzus létrehozását a {platform_name} engedélyezi. A kérésed vizsgálat alatt van.

source: Your request is currently being reviewed by {platform_name} staff and should be updated shortly.
hu: A kérésesedet a {platform_name} munkatársai elbírálják és hamarosan válaszolnak.

source: (Read-only)
hu: (Csak olvasható)

source: Were you expecting to see a particular library here?
hu: Arra számítottál, hogy különböző könyvtárakat fogsz itt találni?

source: The library creator must give you access to the library. Contact the library creator or administrator for the library you are helping to author.
hu: A könyvtár készítőjének hozzáférési jogosultságot kell adnia számodra. Vedd fel a kapcsolatot az adott könyvtár készítőjével vagy az adminisztrátorral.

source: Create Your First Library
hu: Készítsd el az első könyvtáradat

source: Libraries hold a pool of components that can be re-used across multiple courses. Create your first library with the click of a button!
hu: A könyvtár olyan komponensek gyűjteménye, amely különböző kurzusokban egyaránt felhasználható. Készítsd el az első könyvtáradat egy gombnyomással!

source: New to {studio_name}?
hu: Új vagy a {studio_name} rendszerben?

source: Click Help in the upper-right corner to get more information about the {studio_name} page you are viewing. You can also use the links at the bottom of the page to access our continually updated documentation and other {studio_name} resources.
hu: Kattints a Segítségre a jobb felső sarokban, a bővebb információért az {studio_name} rendszerrel kapcsolatban. Használhatod a lenti linket is, hogy elérd a folyamatosan frissített angol nyelvű dokumentációt és egyéb {studio_name} erőforrásokat.

source: Getting Started with {studio_name}
hu: Kezdjünk bele az {studio_name} használatába

source: Use our feedback tool, Tender, to request help
hu: Használd a Tender nevű eszközt, ha segítséget kérsz

source: Request help with {studio_name}
hu: Segítség kérése a {studio_name} rendszerhez

source: Can I create courses in {studio_name}?
hu: Hozhatok létre kurzusokat a {studio_name} rendszerben?

source: In order to create courses in {studio_name}, you must {link_start}contact {platform_name} staff to help you create a course{link_end}.
hu: Ha szeretnél kurzust létrehozni a {studio_name} rendszerben, akkor {link_start}lépj kapcsolatba a {platform_name} tagjaival, akik segítenek a kurzus létrehozásában{link_end}.

source: In order to create courses in {studio_name}, you must have course creator privileges to create your own course.
hu: Ha szeretnél a {studio_name} rendszerben kurzust létrehozni, akkor megfelelő jogosultságokkal kell rendelkezned.

source: Your request to author courses in {studio_name} has been denied. Please {link_start}contact {platform_name} Staff with further questions{link_end}.
hu: Elutasítottuk a kérésedet, hogy kurzust szerkessz a {studio_name} rendszerben. Kérjük, {link_start}lépj kapcsolatba a {platform_name} tagjaival, ha további kérdéseid vannak{link_end}.

source: Thanks for signing up, %(name)s!
hu: Köszönjük, hogy regisztráltál, %(name)s!

source: We need to verify your email address
hu: Ellenőriznünk kell az e-mail címed

source: Almost there! In order to complete your sign up we need you to verify your email address (%(email)s). An activation message and next steps should be waiting for you there.
hu: Majdnem kész! A regisztráció befejezéséhez ellenőriznünk kell a az e-mail címedet (%(email)s). Egy aktivációs üzenetet küldtünk és leírtuk a következő lépéseket.

source: Need help?
hu: Segítségre van szükséged?

source: Please check your Junk or Spam folders in case our email isn't in your INBOX. Still can't find the verification email? Request help via the link below.
hu: Ha a levél nincs a bejövő mappában, ellenőrizd a levélszemét mappát. Ha még mindig nincs meg az e-mail, akkor az alábbi linken kérhetsz segítséget.

source: Request help with your {studio_name} account
hu: Segítség kérése a {studio_name} fiókodhoz

source: Add Component
hu: Komponens hozzáadása

source: Adding content to your library
hu: Tartalom hozzáadása a könyvtárhoz

source: Add components to your library for use in courses, using Add New Component at the bottom of this page.
hu: A könyvtáradhoz az Új komponens hozzáadásával adhatsz komponenseket, amelyeket a kurzusaidban használhatsz

source: Components are listed in the order in which they are added, with the most recently added at the bottom. Use the pagination arrows to navigate from page to page if you have more than one page of components in your library.
hu: A komponenseket abban a sorrendben listázzuk, ahogy hozzáadták őket. A legújabb kerül alulra. Használd a navigációs nyilakat, ha több, mint egy oldalnyi komponens van a könyvtárban.

source: Using library content in courses
hu: Könyvtár tartalmának használata a kurzusokban

source: Use library content in courses by adding the {em_start}library_content{em_end} policy key to the Advanced Module List in the course's Advanced Settings, then adding a Randomized Content Block to your courseware. In the settings for each Randomized Content Block, select this library as the source library, and specify the number of problems to be randomly selected and displayed to each student.
hu: A könyvtár tartalmát úgy tudod a kurzusban használni, hogy a {em_start}library_content{em_end} kulcsot hozzáadod a Speciális Modulok Listájához a kurzus Speciális Beállítások menüjében. Ezután a Véletlen tartalom blokk hozzáadható a kurzusodhoz. A Véletlen tartalom blokk beállításainál válaszd ki ezt a könyvtárt forráskönyvtárként. Add meg, hány véletlen feladatot szeretnél hallgatónként megjeleníteni.

source: Learn more about content libraries
hu: Tudj meg többet a tartalom könyvtárakról

source: Sign In
hu: Bejelentkezés

source: Sign In to {studio_name}
hu: Jelentkezz be a {studio_name} rendszerbe

source: Don't have a {studio_name} Account? Sign up!
hu: Ha nincs még {studio_name} fiókod, regisztrálj!

source: Required Information to Sign In to {studio_name}
hu: A {studio_name} bejelentkezéshez szükséges adatok

source: {studio_name} Support
hu: {studio_name} Szupport

source: Having trouble with your account? Use {link_start}our support center{link_end} to look over self help steps, find solutions others have found to the same problem, or let us know of your issue.
hu: Gond van a fiókoddal? Használd a {link_start}támogatási központunkat{link_end}, hogy áttekintsük közösen a lépéseket, megoldást találjunk, amit már mások megoldottak, vagy tudjunk az egyedi problémáidról.

source: Course Team Settings
hu: Oktatói csapat beállításai

source: New Team Member
hu: Új csapattag

source: Add a User to Your Course's Team
hu: Felhasználó hozzáadása az oktatói csapathoz

source: New Team Member Information
hu: Új csapattag adatai

source: User's Email Address
hu: Felhasználók e-mail címei

source: Please provide the email address of the course staff member you'd like to add
hu: Add meg az email címét annak az oktatónak, akit hozzá akarsz adni a kurzushoz

source: Add User
hu: Felhasználó hozzáadása

source: Add Team Members to This Course
hu: Csapattag hozzáadása a kurzushoz

source: Adding team members makes course authoring collaborative. Users must be signed up for {studio_name} and have an active account.
hu: Adj a kurzus készítéshez csapattagokat, és szerkesszétek közösen. A csapattagoknak regisztrálni kell a {studio_name} rendszerbe és aktív felhasználói fiókra van szükségük.

source: Add a New Team Member
hu: Új csapattag hozzáadása

source: Course Team Roles
hu: Oktatói csapat jogok

source: Course team members, or staff, are course co-authors. They have full writing and editing privileges on all course content.
hu: Kurzus csapattagok, más néven a stáb a kurzus társszerzői. Teljes körű írási és szerkesztési joguk van a teljes kurzus tartalomra

source: Admins are course team members who can add and remove other course team members.
hu: A rendszergazdák olyan kurzus tagok, akik hozzá tudnak adni és el tudnak távolítani másik csapattagot.

source: Transferring Ownership
hu: Tulajdonjog átruházása

source: Every course must have an Admin. If you're the Admin and you want transfer ownership of the course, click Add admin access to make another user the Admin, then ask that user to remove you from the Course Team list.
hu: Minden kurzushoz kell egy Rendszergazda. Ha te vagy a Rendszergazda, és át akarod adni a kurzust másnak, akkor előbb egy másik felhasználót tegyél Rendszergazdává, és kérd meg, hogy töröljön téged a kurzus csapatából.

source: Library User Access
hu: Könyvtár felhasználói hozzáférések

source: User Access
hu: Felhasználó hozzáférés

source: Grant Access to This Library
hu: Hozzáférés engedélyezése ehhez a könyvtárhoz

source: Provide the email address of the user you want to add
hu: Adja meg a felvenni kívánt felhasználó e-mail címét

source: Add More Users to This Library
hu: Adj további felhasználókat a könyvtárhoz

source: Grant other members of your course team access to this library. New library users must have an active {studio_name} account.
hu: Adj a csapatod tagjainak hozzáférést ehhez a könyvtárhoz. A könyvtár felhasználóinak aktív {studio_name} fiókra van szükségük.

source: Add a New User
hu: Új felhasználó hozzáadása

source: Library Access Roles
hu: Könyvtár szerepkörök

source: There are three access roles for libraries: User, Staff, and Admin.
hu: Három szerepkör van a könyvtárakhoz: felhasználó, stábtag, rendszergazda

source: Users can view library content and can reference or use library components in their courses, but they cannot edit the contents of a library.
hu: A felhasználók láthatják a könyvtár tartalmát, hivatkozhatnak és felhasználhatják a könyvtár komponenseit a kurzusaikban, de nem szerkeszthetik a könyvtár tartalmát.

source: Staff are content co-authors. They have full editing privileges on the contents of a library.
hu: A stáb tagjai a tartalom társszerzői. A könyvtári tartalmat szabadon szerkeszthetik.

source: Admins have full editing privileges and can also add and remove other team members. There must be at least one user with Admin privileges in a library.
hu: A Rendszergazdának korlátlan szerkesztési jogosultsága van, valamint további csapattagokat adhat hozzá és törölheti is őket. Legalább egy Rendszergazdának kell lenni a könyvtárhoz rendelve.

source: Sign Up
hu: Regisztráció

source: Sign Up for {studio_name}
hu: Regisztrálj a {studio_name} rendszerbe

source: Already have a {studio_name} Account? Sign in
hu: Már van {studio_name} fiókod? Jelentkezz be

source: Ready to start creating online courses? Sign up below and start creating your first {platform_name} course today.
hu: Készen állsz, hogy online kurzusokat készíts? Regisztrálj lent és készítsd el az első {platform_name} kurzusod még ma!

source: Required Information to Sign Up for {studio_name}
hu: A {studio_name} regisztrációhoz szükséges adatok

source: This will be used in public discussions with your courses and in our edX101 support forums
hu: Ez fog látszódni a kurzussal kapcsolatos nyilvános vitákban és az edX101 támogatói fórumában.

source: Your Location
hu: Hely

source: I agree to the {a_start} Terms of Service {a_end}
hu: Elfogadom a {a_start} Szolgáltatási feltételeket {a_end}

source: Create My Account &amp; Start Authoring Courses
hu: Készítsd el a fiókom &amp; Készítsünk kurzusokat

source: Common {studio_name} Questions
hu: {studio_name} gyakori kérdések

source: Who is {studio_name} for?
hu: Kinek van szüksége az {studio_name}?

source: {studio_name} is for anyone that wants to create online courses that leverage the global {platform_name} platform. Our users are often faculty members, teaching assistants and course staff, and members of instructional technology groups.
hu: {studio_name} mindenkinek javasolt, aki a {platform_name} platformban rejlő lehetőségek segítségével online kurzust szeretne készíteni. A felhasználóink gyakran oktatók, tanársegédek, az oktatási személyzet tagjai és az oktatástechnológiai csoport tagjai.

source: How technically savvy do I need to be to create courses in {studio_name}?
hu: Milyen technikai ismeret szükséges {studio_name}-ban történő kurzusok készítéséhez?

source: {studio_name} is designed to be easy to use by almost anyone familiar with common web-based authoring environments (Wordpress, Moodle, etc.). No programming knowledge is required, but for some of the more advanced features, a technical background would be helpful. As always, we are here to help, so don't hesitate to dive right in.
hu: {studio_name} rendszert úgy terveztük, hogy könnyen használható legyen bárki számára, aki egy kis ismerettel rendelkezik a web alapú szerkesztőkörnyezetek használatához (Wordpress, Moodle, stb.). Nincs szükség programozói tudásra, de a haladó szintű funkciókhoz nem árt egy kis informatikai háttér. Mint mindig, mi itt vagyunk és segítünk, szóval ne habozz, kezd azonnal!

source: I've never authored a course online before. Is there help?
hu: Még sohasem készítettem online kurzust. Van segítség?

source: Absolutely. We have created an online course, edX101, that describes some best practices: from filming video, creating exercises, to the basics of running an online course. Additionally, we're always here to help, just drop us a note.
hu: Feltétlenül. Készítettünk egy online kurzust, edX101 kóddal, ami bemutatja a leggyakoribb praktikákat: videó készítést, feladatok készítését és az online kurzusok elindításának alapjait. Ráadásul mi mindig itt vagyunk és segítünk, csak dobj egy üzenetet.

source: Schedule &amp; Details Settings
hu: Ütemezés &amp; részletek beállítása

source: Schedule & Details
hu: Ütemezés & részletek

source: Basic Information
hu: Alapinformációk

source: The nuts and bolts of your course
hu: A kurzus sava-borsa

source: This field is disabled: this information cannot be changed.
hu: Ez nem szerkeszthető mező: ez az információ nem változtatható meg.

source: Course Summary Page
hu: Kurzus összefoglaló lap

source: (for student enrollment and access)
hu: (a tanulók feliratkozásához és a kurzus eléréséhez)

source: Enroll in {course_display_name}
hu: Feliratkozás a {course_display_name} kurzusra

source: The course "{course_display_name}", provided by {platform_name}, is open for enrollment. Please navigate to this course at {link_for_about_page} to enroll.
hu: A "{course_display_name}" kurzus, a {platform_name} rendszerben megnyílt a feliratkozók számára. Lépj a {link_for_about_page} oldalra, hogy feliratkozz erre a kurzusra.

source: Send a note to students via email
hu: Jegyzet elküldése e-mailben a tanulók számára

source: Invite your students
hu: Tanulók meghívása

source: Promoting Your Course with {platform_name}
hu: A kurzus reklámozása a {platform_name} platformon
