Repository: knehez/edx-hun-trans
Catalog: mako-studio.po
Languages: hu

source: Your course summary page will not be viewable until your course has been announced. To provide content for the page and preview it, follow the instructions provided by your Program Manager.
hu: A kurzus összegző oldala nem látható addig, amíg a kurzust meg nem hirdetted, Ha ehhez az oldalhoz tartalmat szeretnél adni, kérdezd a Program menedzsert.

source: Credit Eligibility Requirements
hu: Kredit megszerzésének követelményei

source: Steps needed for credit eligibility
hu: Kredit megszerzésének lépései

source: Minimum Passing Grade
hu: Minimális osztályzat

source: Successful Proctored Exam
hu: Sikeres felügyelt vizsga

source: Proctored Exam {number}
hu: Felügyelt vizsga {number}

source: Successful In-Course Reverification
hu: Sikeresen ellenőriztük a kurzust

source: In-Course Reverification {number}
hu: A tanfolyam ellenőrzése {number}

source: Access to {display_name}
hu: Hozzáférés ehhez: {display_name}

source: Course Schedule
hu: Kurzus ütemezése

source: Dates that control when your course can be viewed
hu: Lényeges dátumok, amikor a kurzus már láthatóvá válik

source: First day the course begins
hu: Kurzus kezdetének első napja

source: Course Start Time
hu: Kurzus kezdési ideje

source: Last day your course is active
hu: A kurzus utolsó napja

source: Course End Time
hu: Kurzus befejeződésének ideje

source: Enrollment Start Date
hu: Feliratkozás kezdő dátuma

source: First day students can enroll
hu: Az első nap, amikortól a tanulók feliratkozhatnak

source: Enrollment Start Time
hu: Feliratkozás kezdő ideje

source: Enrollment End Date
hu: Feliratkozás befejező dátuma

source: Last day students can enroll
hu: Utolsó nap, amikor a tanulók még feliratkozhatnak

source: Enrollment End Time
hu: Feliratkozás befejező ideje

source: These Dates Are Not Used When Promoting Your Course
hu: Ezek a dátumok nem látszódnak amikor hirdeted a kurzusodat.

source: These dates impact <strong>when your courseware can be viewed</strong>, but they are <strong>not the dates shown on your course summary page</strong>. To provide the course start and registration dates as shown on your course summary page, follow the instructions provided by your Program Manager.
hu: Ezek a dátumok azt befolyásolják, <strong>mikor látható a kurzusod</strong>, de ezek a dátumok <strong>nincsenek e kurzus összegzés oldalon</strong>. Kövesd a program menedzsered utasításait, állítsd be a kurzus kezdő és regisztrációs dátumát ugyanúgy, mint a kurzus összegzés oldalon.

source: Course Details
hu: Kurzus adatai

source: Provide useful information about your course
hu: Adj meg információkat a kurzusodról

source: Course Language
hu: Kurzus nyelve

source: Identify the course language here. This is used to assist users find courses that are taught in a specific language.
hu: Határozd meg a kurzus nyelvét itt. A hallgatók ez alapján fogják tudni megtalálni a számukra megfelelőt.

source: Introducing Your Course
hu: Kurzus bemutatása

source: Information for prospective students
hu: Információk a leendő tanulók részére

source: Course Short Description
hu: Kurzus rövid leírása

source: Appears on the course catalog page when students roll over the course name. Limit to ~150 characters
hu: A rövid összefoglaló a kurzus listázásánál jelenik meg a kurzus nevén állva. Maximális mérete 150 karakter.

source: Course Overview
hu: Áttekintés

source: your course summary page
hu: kurzus áttekintő lap

source: Introductions, prerequisites, FAQs that are used on %s (formatted in HTML)
hu: Bevezető, előképzettség, GyIK, amiket a %s -ben használsz (formázott HTML-ben)

source: Course Image
hu: Kurzus képe

source: You can manage this image along with all of your other <a href='{}'>files &amp; uploads</a>
hu: Ezt a képet a <a href='{}'>fájlok &amp; feltöltések</a> oldalon kezelheted.

source: Your course currently does not have an image. Please upload one (JPEG or PNG format, and minimum suggested dimensions are 375px wide by 200px tall)
hu: A kurzusodhoz nem rendeltél még képet. Tölts fel egyet (JPEG, vagy PNG formátumban, legalább 375px x 200px méretben javasolt)

source: Your course image URL
hu: A kurzus képének URL címe

source: Please provide a valid path and name to your course image (Note: only JPEG or PNG format supported)
hu: Érvényes útvonalat és nevet adj meg a kurzus képéhez (Figyelem: csak JPEG, vagy PNG formátum támogatott)

source: Upload Course Image
hu: Kurzus kép feltöltése

source: Course Introduction Video
hu: Kurzus bemutató videó

source: Delete Current Video
hu: Aktuális videó törlése

source: your YouTube video's ID
hu: A YouTube videód azonosítója

source: Enter your YouTube video's ID (along with any restriction parameters)
hu: Írd be a YouTube videó azonosítóját (minden egyéb paraméterrel együtt)

source: Expectations of the students taking this course
hu: Elvárások a kurzust választó tanulókkal szemben

source: Hours of Effort per Week
hu: Hetente tanulásra fordítandó óra

source: Time spent on all course work
hu: A kurzusra fordítandó összes idő

source: Prerequisite Course
hu: Előfeltételi kurzus

source: None
hu: Nincs

source: Course that students must complete before beginning this course
hu: Az a kurzus, amelyet a hallgatónak el kell végeznie, mielőtt elkezdi ezt a kurzust

source: set pre-requisite course
hu: előfeltételi kurzus beállítása

source: Entrance Exam
hu: Belépő vizsga

source: Require students to pass an exam before beginning the course.
hu: Mielőtt megkezdenék ezt a kurzust, a hallgatóknak vizsgát kell tenniük.

source: You can now view and author your course entrance exam from the {link_start}Course Outline{link_end}.
hu: Most már láthatod és szerkesztheted a kurzus belépő vizsgáját a {link_start}kurzus vázlat{link_end} linken.

source: Grade Requirements
hu: Vizsgakövetelmények

source: The score student must meet in order to successfully complete the entrance exam.
hu: Az a pontszám, amelyet a hallgatóknak el kell érniük, hogy sikeres belépő vizsgát tegyenek.

source: Course Content License
hu: Kurzus anyagának licence

source: Select the default license for course content
hu: A kurzus anyagának alapértelmezett licence

source: How are these settings used?
hu: Hogyan használjuk ezeket a beállításokat?

source: Your course's schedule determines when students can enroll in and begin a course.
hu: A kurzus ütemezése meghatározza, hogy a tanulók mikor tudnak feliratkozni és elkezdeni a kurzust.

source: Other information from this page appears on the About page for your course. This information includes the course overview, course image, introduction video, and estimated time requirements. Students use About pages to choose new courses to take.
hu: További információkat a Kurzusról oldalon találsz. Ezek az információk: kurzus áttekintése, kurzus képe, bevezető videó és a kurzus elvégzéséhez szükséges idő. A tanulók a Kurzusról lapot látják, amikor kurzust választanak.

source: Your policy changes have been saved.
hu: Szabályzat változtatásai elmentve.

source: There was an error saving your information. Please see below.
hu: Hiba történt az adatok mentése közben. Lásd lentebb.

source: Manual Policy Definition
hu: Manuális szabályzat meghatározás

source: <strong>Warning</strong>: Do not modify these policies unless you are familiar with their purpose.
hu: <strong>Figyelem</strong>: ezeket a szabályok csak saját felelősségedre módosítsd.

source: Show Deprecated Settings
hu: Hibás beállítások megjelenítése

source: What do advanced settings do?
hu: Mit jelentenek a speciális beállítások?

source: Advanced settings control specific course functionality. On this page, you can edit manual policies, which are JSON-based key and value pairs that control specific course settings.
hu: A speciális beállítások segítségével testre szabhatod a kurzusodat. Ezen az oldalon ezt kézzel megteheted. Kérlek olvasd el a megjegyzésekben foglaltakat alább.

source: Any policies you modify here override all other information you've defined elsewhere in {studio_name}. Do not edit policies unless you are familiar with both their purpose and syntax.
hu: Ezek a beállítások a kurzuson belül globálisan értendőek, csak akkor módosítsd ha biztosan érted a beállítás használatának szabályait.

source: {em_start}Note:{em_end} When you enter strings as policy values, ensure that you use double quotation marks (&quot;) around the string. Do not use single quotation marks (&apos;).
hu: {em_start}Megjegyzés:{em_end} Szöveges értékek megadásakor akkor idézőjelek (&quot;) add meg a beállítást. Ne használj aposztrófot!

source: Grading Settings
hu: Értékelés beállításai

source: Overall Grade Range
hu: Teljes osztályozási tartomány

source: Your overall grading scale for student final grades
hu: A végleges osztályozás módjának beállítása. Megj: F=elégtelen, D=elégséges, C=közepes, B=jó, A=jeles

source: Credit Grade &amp; Eligibility
hu: Kreditszerzés &amp; Követelmények

source: Settings for credit eligibility
hu: Kredit megszerzésének beállításai

source: Minimum Passing Grade to Earn Credit:
hu: A kredit megszerzéséhez szükséges osztályzat:

source: Must be greater than or equal to passing grade
hu: Legyen nagyobb, vagy egyenlő, hogy levizsgázz

source: Grading Rules &amp; Policies
hu: Értékelési szabályok &amp; irányelvek

source: Deadlines, requirements, and logistics around grading student work
hu: Határidők, követelmények és az osztályozás finombeállításai

source: Grace Period on Deadline:
hu: A megengedett határidő túllépés:

source: Leeway on due dates
hu: A hallgatók a határidőn túl ennyi idővel később még teljesíthetik a feladatot

source: Assignment Types
hu: Feladattípusok

source: Categories and labels for any exercises that are gradable
hu: Kategóriák és címek az értékelésre kerülő feladatokhoz

source: New Assignment Type
hu: Új feladat típus

source: What can I do on this page?
hu: Mit tudok tenni ezen az oldalon?

source: You can use the slider under Overall Grade Range to specify whether your course is pass/fail or graded by letter, and to establish the thresholds for each grade.
hu: A teljes értékelési tartomány alatti csúszkával beállíthatod a jegyekhez tartozó osztályozási tartományokat.

source: You can specify whether your course offers students a grace period for late assignments.
hu: Adhatsz haladékot a tanulóknak a teljesítésre.

source: You can also create assignment types, such as homework, labs, quizzes, and exams, and specify how much of a student's grade each assignment type is worth.
hu: Könnyen készíthetsz különböző feladat típusokat, mint házi feladat, labor munka, teszt és vizsgafeladatok és azt is megadhatod, hogy milyen súlyozással kerül beszámításra a tanuló értékelésénél.

source: Expand or Collapse
hu: Kinyitás, vagy összecsukás

source: Visibility Settings
hu: Láthatósági beállítások

source: Visibility
hu: Láthatóság

source: This block contains multiple components.
hu: Ez a blokk több komponenst tartalmaz.

source: Textbooks
hu: Tankönyvek

source: New Textbook
hu: Új tankönyv

source: Why should I break my textbook into chapters?
hu: Mért célszerű fejezetekre tördelnem a tankönyvet?

source: Breaking your textbook into multiple chapters reduces loading times for students, especially those with slow Internet connections. Breaking up textbooks into chapters can also help students more easily find topic-based information.
hu: A tankönyv fejezetekre történő tagolása lerövidíti a tanulóknak a betöltési időt; kifejezetten azoknak előnyös, akik lassú internet kapcsolattal rendelkeznek. A fejezetekre történő tagolás abban is segítheti a tanulókat, hogy könnyebben megtalálják a témakörök szerinti információkat.

source: What if my book isn't divided into chapters?
hu: Mi történik akkor, ha a tankönyvet nem tördelem fejezetekre?

source: If your textbook doesn't have individual chapters, you can upload the entire text as a single chapter and enter a name of your choice in the Chapter Name field.
hu: Ha a tankönyv nem tartalmaz egyedi fejezeteket, akkor feltöltheted az egészet, úgy, mintha egy fejezet lenne az egész és a fejezet címe mezőbe azt írsz, amit csak szeretnél.

source: Learn more about textbooks
hu: Tudj meg többet a tankönyvekről

source: Video Uploads
hu: Videó feltöltések

source: Why upload video files?
hu: Miért töltsünk fel videókat?

source: For a video to play on different devices, it needs to be available in multiple formats. After you upload an original video file in .mp4 or .mov format on this page, an automated process creates those additional formats and stores them for you.
hu: Ahhoz hogy a videó több eszközön is megtekinthető legyen, többféle formában is rendelkezésre kell állnia. Miután feltöltötted az eredeti videót .mp4 vagy .mov formátumban, a weboldal automatikusan elkészíti a további szükséges változatokat.

source: Monitoring files as they upload
hu: Fájlok ellenőrzése feltöltés közben

source: Each video file that you upload needs to reach the video processing servers successfully before additional work can begin. You can monitor the progress of files as they upload, and try again if the upload fails.
hu: Minden videót, amit feltöltesz a szerver fel kell , hogy dolgozzon, mielőtt megkezded vele a munkát. Ellenőrizheted a feltöltés előrehaladását. Hibás feltöltés esetén próbálkozz újra.

source: Managing uploaded files
hu: Feltöltött fájlok kezelése

source: After a file uploads successfully, automated processing begins. After automated processing begins for a file it is listed under Previous Uploads as {em_start}In Progress{em_end}. You can add the video to your course as soon as it has a unique video ID and the status is {em_start}Ready{em_end}. Allow 24 hours for file processing at the external video hosting sites to complete.
hu: A fájl feltöltése után azt automatikusan feldolgozzuk. Az automatikus feldolgozás alatt a fájlt az előző feltöltések között találod, mint {em_start}Folyamatban{em_end}. A videót akkor adhatod a kurzusodhoz, amikor az egyedi videó azonosító elkészül és a státusza {em_start}Kész{em_end}. A külső videó hoszt oldalakon akár 24 órát is eltarthat a feldolgozás.

source: If something goes wrong, the {em_start}Failed{em_end} status message appears. Check for problems in your original file and upload a replacement.
hu: Ha valami elromlik, a{em_start}hiba{em_end} üzenet jelenik meg. Az eredeti fájlodban keresd meg a hibát, és a javított fájlt töltsd fel.

source: How do I get the videos into my course?
hu: Hogyan viszem be a videókat a kurzusomba?

source: As soon as the status for a file is {em_start}Ready{em_end}, you can add that video to a component in your course. Copy the unique video ID. In another browser window, on the Course Outline page, create or locate a video component to play this video. Edit the video component to paste the ID into the Advanced {em_start}Video ID{em_end} field. The video can play in the LMS as soon as its status is {em_start}Ready{em_end}, although processing may not be complete for all encodings and all video hosting sites.
hu: Amint a fájl státusza {em_start}Kész{em_end}, hozzáadhatod a videót a kurzus egy komponenséhez. Másold ki az egyedi videóazonosítót. Egy másik böngésző ablakban, a Kurzus Vázlat oldalon válaszd ki vagy hozd létre azt a komponenst, ahová a videó kerül. Szerkeszd a videó komponenst és illeszd be az azonosítót a {em_start}Video ID{em_end} mezőbe. Az LMS rendszerben a videó akkor játszható le, a státusza {em_start}Kész{em_end}, bár a teljes videó feldolgozás és hosztolás még futhat ezalatt.

source: No content groups exist
hu: Még nincs tartalom csoport létrehozva

source: Use content groups to give groups of students access to a specific set of course content. Create one or more content groups, and make specific components visible to them.
hu: Használj tartalomcsoportokat, hogy a hallgatók egy csoportjának külön tartalmat adj. Hozz létre egy vagy több tartalomcsoportot, és a külön tartalmat tedd a számukra láthatóvá.

source: Manage content groups
hu: Tartalmi csoport menedzselése

source: {screen_reader_start}Warning:{screen_reader_end} The Unit this component is contained in is hidden from students. Visibility settings here will be trumped by this.
hu: {screen_reader_start}Vigyázat:{screen_reader_end} Az a lecke, amit a komponens tartalmaz, rejtve van a hallgatók elől. A láthatósági beállításokat ezzel felülírod!

source: Make visible to:
hu: Legyen látható:

source: All Students and Staff
hu: Minden hallgató és a stáb

source: Specific Content Groups
hu: Specifikus tartalom csoportok

source: Deleted Content Group
hu: Törölt tartalmi csoport

source: Content group no longer exists. Please choose another or allow access to All Students and staff
hu: A tartalom csoport már nem létezik. Kérlek válassz másikat vagy engedélyezd a hozzáférést minden hallgatónak és staffnak

source: Thank you for signing up for {studio_name}! To activate your account, please copy and paste this address into your web browser's address bar:
hu: Köszönjük, hogy regisztráltál a {studio_name}-ra! A fiókod aktiválásához kérlek másold be ez a címet a böngésző címsorába:

source: If you didn't request this, you don't need to do anything; you won't receive any more email from us. Please do not reply to this e-mail; if you require assistance, check the help section of the {studio_name} web site.
hu: Ha nem te kérted ezt, akkor semmi teendőd nincs. Kérlek, ne válaszolj erre az e-mailre. Ha segítségre van szükséged, a {studio_name} weblapon találsz súgót

source: Your account for {studio_name}
hu: A {studio_name} fiókod

source: {email} has requested {studio_name} course creator privileges on edge
hu: {email} {studio_name} kurzus létrehozási jogosultságot kért

source: User '{user}' with e-mail {email} has requested {studio_name} course creator privileges on edge.
hu: A '{user}' felhasználó {email} e-mail címmel {studio_name} kurzus létrehozási jogosultságot kért.

source: To grant or deny this request, use the course creator admin table.
hu: Ahhoz. hogy elfogad, vagy elutasítsd a kérelmet használd a kurzus készítő táblát.

source: Your request for course creation rights to {studio_name} have been denied. If you believe this was in error, please contact {email}
hu: A {studio_name} kurzus létrehozásának joga megtagadva. Ha hiba történt, kérlek értesíts minket a(z) {email} címen

source: Your request for course creation rights to {studio_name} have been granted. To create your first course, visit {url}
hu: A {studio_name} kurzus létrehozási jogosultságot adott. Hozd létre az első kurzusodat, látogasd meg {url}

source: Your course creation rights to {studio_name} have been revoked. If you believe this was in error, please contact {email}
hu: A {studio_name} kurzus létrehozásának jogai visszavonásra kerültek. Ha hiba történt, kérlek értesíts minket a(z) {email} címen

source: Your course creator status for {studio_name}
hu: {studio_name} kurzus létrehozásának státusza

source: You can now {link_start}login{link_end}.
hu: Most már {link_start}bejelentkezhetsz{link_end}.

source: An activation link has been sent to {email}, along with instructions for activating your account.
hu: Az aktivációs linket elküldtük a {email} címre. A levélben megtalálod, hogyan aktiválhatod a fiókodat

source: Contact Us
hu: Vedd fel velünk a kapcsolatot

source: Powered by Open edX
hu: Powered by MeDX

source: Current Course:
hu: Aktuális kurzus:

source: Course
hu: Kurzus

source: Outline
hu: Vázlat

source: Updates
hu: Hirdetmények

source: Schedule &amp; Details
hu: Ütemezés &amp; Részletek

source: Checklists
hu: Ellenőrzőlista

source: Import
hu: Importálás

source: Export
hu: Exportálás

source: Current Library:
hu: Aktuális könyvtár:

source: Library
hu: Könyvtár

source: Account
hu: Fiók

source: Account Navigation
hu: Fiók navigáció

source: Contextual Online Help
hu: Környezetérzékeny online súgó

source: Currently signed in as:
hu: Jelenleg be vagy jelentkezve, mint:

source: Launch Latex Source Compiler
hu: LaTex forrásnyelvű fordító indítása

source: Heading 1
hu: Címsor 1

source: Multiple Choice
hu: Több Lehetőség

source: Checkboxes
hu: Jelölőnégyzet

source: Text Input
hu: Szöveges beviteli mező

source: Numerical Input
hu: Numerikus beviteli mező

source: Dropdown
hu: Legördülő lista

source: Explanation
hu: Magyarázat

source: Advanced Editor
hu: Haladó szerkesztő

source: Toggle Cheatsheet
hu: Puskára váltás

source: Label
hu: Címke

source: Looking for help with {studio_name}?
hu: Segítségre van szükséged a {studio_name}-val kapcsolatban?

source: Hide {studio_name} Help
hu: {studio_name} súgó elrejtése

source: {studio_name} Documentation
hu: {studio_name} dokumentáció

source: You can click Help in the upper right corner of any page to get more information about the page you're on. You can also use the links below to download the Building and Running an {platform_name} Course PDF file, to go to the {platform_name} Author Support site, or to enroll in edX101.
hu: A jobb felső sarokban lévő Segítség-re kattintva további információkat kapsz az aktuális oldallal kapcsolatban. Használhatod az alábbi linket is, hogy letöltsd Kurzusok készítése segédanyag {platform_name} PDF fájlt, nézd meg az {platform_name} oldalt, vagy iratkozz fel az edX101 kurzusra.

source: Building and Running an {platform_name} Course PDF
hu: Kurzusok készítése {platform_name} segédanyag PDF-ben

source: {studio_name} Author Support
hu: {studio_name} Szerzői Támogatás

source: Enroll in edX101
hu: Iratkozz fel az edx101 kurzusra

source: How to use {studio_name} to build your course
hu: Hogyan használd az {studio_name}-t kurzus készítéséhez

source: Have problems, questions, or suggestions about {studio_name}?
hu: Problémáid adódtak, kérdésed volna, vagy javaslatod az {studio_name}-al kapcsolatban?

source: name
hu: név
