Repository: knehez/edx-hun-trans
Catalog: openassessment-js.po
Languages: hu

source: This section could not be loaded.
hu: Ezt a fejezetet nem sikerült beölteni.

source: This response could not be submitted.
hu: A válasz elküldése nem sikerült.

source: This response could not be saved.
hu: A válasz mentése nem sikerült.

source: This feedback could not be submitted.
hu: A visszacsatolás elküldése nem sikerült.

source: This assessment could not be submitted.
hu: Az értékelés elküldése nem sikerült.

source: One or more rescheduling tasks failed.
hu: Egy, vagy több átütemezési feladat meghiúsult.

source: This problem could not be saved.
hu: Ez a feladat nem menthető.

source: The server could not be contacted.
hu: Sikertelen csatlakozás a szerverhez

source: Could not retrieve upload url.
hu: A feltöltési URL nem elérhető.

source: Could not retrieve download url.
hu: A letöltési URL nem elérhető.

source: The submission could not be removed from the grading pool.
hu: A beküldött anyag nem törölhető

source: Unable to Load
hu: Nem sikerült betölteni

source: Status of Your Response
hu: A válaszod állapota

source: If you leave this page without saving or submitting your response, you'll lose any work you've done on the response.
hu: Ha ezt az oldalt nem mented el, vagy nem küldöd el a választ, akkor minden el fog veszni.

source: This response has not been saved.
hu: A válasz nincs elmentve.

source: Saving...
hu: Mentés...

source: This response has been saved but not submitted.
hu: Ez a válasz már mentésre került, de még nem küldted el.

source: Error
hu: Hiba

source: You're about to submit your response for this assignment. After you submit this response, you can't change it or submit a new response.
hu: Miután beküldted a feladatodat nem változtathatod meg és nem küldhetsz be új választ.

source: File size must be 5MB or less.
hu: A fájl mérete maximum 5MB lehet.

source: File must be an image.
hu: A fájlnak kép fájlnak kell lennie.

source: Unnamed Option
hu: Névtelen opció

source: Not Selected
hu: Nincs kiválasztva

source: Couldn't Save This Assignment
hu: Ezt a hozzárendelést nem sikerült menteni

source: Please correct the outlined fields.
hu: Kérlek javítsd a kijelölt mezőket.

source: This problem has already been released. Any changes will apply only to future assessments.
hu: Ez a feladat már kiadásra került. Minden változás csak az értékelés után lesz elérhető.

source: Criterion Added
hu: Értékelési szempont hozzáadva

source: You've added a criterion. You'll need to select an option for the criterion in the Student Training step. To do this, click the Settings tab.
hu: Hozzáadtál egy értékelési szempontot. Az értékelési szemponthoz Opciót kell választanod a tanulói gyakorlásnál. Kattints a Beállítások fülre.

source: Option Deleted
hu: Opció törölve

source: You've deleted an option. The system has removed that option from its criterion in the sample responses in the Student Training step. You may have to select a new option for the criterion.
hu: Töröltél egy opciót. A rendszer eltávolítja ezt az opciót az értékelési szempont a tanulói gyakorlás lépéseinél. Választanod kell egy új opciót az értékelési szemponthoz.

source: You've deleted all the options for this criterion. The system has removed the criterion from the sample responses in the Student Training step.
hu: Az értékelési szemponthoz tartozó összes opciót törölted. A rendszer eltávolítja az értékelési szempontot a minta válaszokból a tanulói gyakorlásnál.

source: Criterion Deleted
hu: Értékelési szempont törölve

source: You've deleted a criterion. The system has removed the criterion from the sample responses in the Student Training step.
hu: Töröltél egy értékelési szempontot. A rendszer eltávolítja ezt az értékelési szempontot a minta válaszokból a tanulói gyakorlásnál.

source: Warning
hu: Figyelmeztetés

source: Changes to steps that are not selected as part of the assignment will not be saved.
hu: Azok a lépések, melyek nem kerültek kijelölésre, nem lesznek elmentve.
